*** crates/eth/src/manager.rs:115:9: replace EthDataCleanser<Sync>::send_events with ()

*** mutation diff:
--- crates/eth/src/manager.rs
+++ replace EthDataCleanser<Sync>::send_events with ()
@@ -107,18 +107,17 @@
 
     fn subscribe_cannon_notifications(
         &self
     ) -> tokio::sync::broadcast::Receiver<CanonStateNotification> {
         self.cannon_sender.subscribe()
     }
 
     fn send_events(&mut self, event: EthEvent) {
-        self.event_listeners
-            .retain(|e| e.send(event.clone()).is_ok());
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn on_command(&mut self, command: EthCommand) {
         match command {
             EthCommand::SubscribeEthNetworkEvents(tx) => self.event_listeners.push(tx),
             EthCommand::SubscribeCannon(tx) => {
                 let _ = tx.send(self.subscribe_cannon_notifications());
             }

---- manager::test::test_handle_commit stdout ----
thread 'manager::test::test_handle_commit' panicked at crates/eth/src/manager.rs:676:29:
Should receive an event: Empty

---- manager::test::test_handle_reorg stdout ----
thread 'manager::test::test_handle_reorg' panicked at crates/eth/src/manager.rs:642:33:
Should receive two events: Empty

---- manager::test::test_empty_block_handling stdout ----
thread 'manager::test::test_empty_block_handling' panicked at crates/eth/src/manager.rs:790:29:
Should receive an event: Empty

failures:
    manager::test::test_empty_block_handling
    manager::test::test_handle_commit
    manager::test::test_handle_reorg

test result: FAILED. 12 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
