*** crates/eth/src/manager.rs:120:9: replace EthDataCleanser<Sync>::on_command with ()

*** mutation diff:
--- crates/eth/src/manager.rs
+++ replace EthDataCleanser<Sync>::on_command with ()
@@ -112,22 +112,17 @@
     }
 
     fn send_events(&mut self, event: EthEvent) {
         self.event_listeners
             .retain(|e| e.send(event.clone()).is_ok());
     }
 
     fn on_command(&mut self, command: EthCommand) {
-        match command {
-            EthCommand::SubscribeEthNetworkEvents(tx) => self.event_listeners.push(tx),
-            EthCommand::SubscribeCannon(tx) => {
-                let _ = tx.send(self.subscribe_cannon_notifications());
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn on_canon_update(&mut self, canonical_updates: CanonStateNotification) {
         match canonical_updates.clone() {
             CanonStateNotification::Reorg { old, new } => self.handle_reorg(old, new),
             CanonStateNotification::Commit { new } => self.handle_commit(new)
         }
         let _ = self.cannon_sender.send(canonical_updates);

*** result: Success
