*** crates/eth/src/manager.rs:129:9: replace EthDataCleanser<Sync>::on_canon_update with ()

*** mutation diff:
--- crates/eth/src/manager.rs
+++ replace EthDataCleanser<Sync>::on_canon_update with ()
@@ -121,21 +121,17 @@
             EthCommand::SubscribeEthNetworkEvents(tx) => self.event_listeners.push(tx),
             EthCommand::SubscribeCannon(tx) => {
                 let _ = tx.send(self.subscribe_cannon_notifications());
             }
         }
     }
 
     fn on_canon_update(&mut self, canonical_updates: CanonStateNotification) {
-        match canonical_updates.clone() {
-            CanonStateNotification::Reorg { old, new } => self.handle_reorg(old, new),
-            CanonStateNotification::Commit { new } => self.handle_commit(new)
-        }
-        let _ = self.cannon_sender.send(canonical_updates);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn handle_reorg(&mut self, old: Arc<impl ChainExt>, new: Arc<impl ChainExt>) {
         self.apply_periphery_logs(&new);
         // notify producer of reorg if one happened. NOTE: reth also calls this
         // on reverts
         let tip = new.tip_number();
         let reorg = old.reorged_range(&new).unwrap_or(tip..=tip);

*** result: Success
