*** crates/eth/src/manager.rs:137:9: replace EthDataCleanser<Sync>::handle_reorg with ()

*** mutation diff:
--- crates/eth/src/manager.rs
+++ replace EthDataCleanser<Sync>::handle_reorg with ()
@@ -129,41 +129,17 @@
         match canonical_updates.clone() {
             CanonStateNotification::Reorg { old, new } => self.handle_reorg(old, new),
             CanonStateNotification::Commit { new } => self.handle_commit(new)
         }
         let _ = self.cannon_sender.send(canonical_updates);
     }
 
     fn handle_reorg(&mut self, old: Arc<impl ChainExt>, new: Arc<impl ChainExt>) {
-        self.apply_periphery_logs(&new);
-        // notify producer of reorg if one happened. NOTE: reth also calls this
-        // on reverts
-        let tip = new.tip_number();
-        let reorg = old.reorged_range(&new).unwrap_or(tip..=tip);
-        self.block_sync.reorg(reorg.clone());
-
-        let mut eoas = self.get_eoa(old.clone());
-        eoas.extend(self.get_eoa(new.clone()));
-
-        // get all reorged orders
-        let old_filled: HashSet<_> = self.fetch_filled_order(&old).collect();
-        let new_filled: HashSet<_> = self.fetch_filled_order(&new).collect();
-
-        let difference: Vec<_> = old_filled.difference(&new_filled).copied().collect();
-        let reorged_orders = EthEvent::ReorgedOrders(difference, reorg);
-
-        let transitions = EthEvent::NewBlockTransitions {
-            block_number:      new.tip_number(),
-            filled_orders:     new_filled.into_iter().collect(),
-            address_changeset: eoas
-        };
-
-        self.send_events(transitions);
-        self.send_events(reorged_orders);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn handle_commit(&mut self, new: Arc<impl ChainExt>) {
         // handle this first so the newest state is the first available
         self.apply_periphery_logs(&new);
 
         let tip = new.tip_number();
         self.block_sync.new_block(tip);

---- manager::test::test_handle_reorg stdout ----
thread 'manager::test::test_handle_reorg' panicked at crates/eth/src/manager.rs:619:33:
Should receive two events: Empty

failures:
    manager::test::test_handle_reorg

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
