*** crates/eth/src/manager.rs:166:9: replace EthDataCleanser<Sync>::handle_commit with ()

*** mutation diff:
--- crates/eth/src/manager.rs
+++ replace EthDataCleanser<Sync>::handle_commit with ()
@@ -158,31 +158,17 @@
         };
 
         self.send_events(transitions);
         self.send_events(reorged_orders);
     }
 
     fn handle_commit(&mut self, new: Arc<impl ChainExt>) {
         // handle this first so the newest state is the first available
-        self.apply_periphery_logs(&new);
-
-        let tip = new.tip_number();
-        self.block_sync.new_block(tip);
-
-        let filled_orders = self.fetch_filled_order(&new).collect::<Vec<_>>();
-
-        let eoas = self.get_eoa(new.clone());
-
-        let transitions = EthEvent::NewBlockTransitions {
-            block_number: new.tip_number(),
-            filled_orders,
-            address_changeset: eoas
-        };
-        self.send_events(transitions);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// looks at all periphery contrct events updating the internal state +
     /// sending out info.
     fn apply_periphery_logs(&mut self, chain: &impl ChainExt) {
         let periphery_address = self.periphery_address;
         chain
             .receipts_by_block_hash(chain.tip_hash())

---- manager::test::test_handle_commit stdout ----
thread 'manager::test::test_handle_commit' panicked at crates/eth/src/manager.rs:663:29:
Should receive an event: Empty

---- manager::test::test_empty_block_handling stdout ----
thread 'manager::test::test_empty_block_handling' panicked at crates/eth/src/manager.rs:777:29:
Should receive an event: Empty

failures:
    manager::test::test_empty_block_handling
    manager::test::test_handle_commit

test result: FAILED. 13 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
