*** crates/eth/src/manager.rs:186:9: replace EthDataCleanser<Sync>::apply_periphery_logs with ()

*** mutation diff:
--- crates/eth/src/manager.rs
+++ replace EthDataCleanser<Sync>::apply_periphery_logs with ()
@@ -178,76 +178,17 @@
             address_changeset: eoas
         };
         self.send_events(transitions);
     }
 
     /// looks at all periphery contrct events updating the internal state +
     /// sending out info.
     fn apply_periphery_logs(&mut self, chain: &impl ChainExt) {
-        let periphery_address = self.periphery_address;
-        chain
-            .receipts_by_block_hash(chain.tip_hash())
-            .unwrap_or_default()
-            .into_iter()
-            .flat_map(|receipt| &receipt.logs)
-            .filter(|log| log.address == periphery_address)
-            .for_each(|log| {
-                if let Ok(remove_node) = NodeRemoved::decode_log(log, true) {
-                    self.node_set.remove(&remove_node.node);
-                    self.send_events(EthEvent::RemovedNode(remove_node.node));
-                }
-                if let Ok(added_node) = NodeAdded::decode_log(log, true) {
-                    self.node_set.insert(added_node.node);
-                    self.send_events(EthEvent::AddedNode(added_node.node));
-                }
-                if let Ok(removed_pool) = PoolRemoved::decode_log(log, true) {
-                    self.pool_store
-                        .remove_pair(removed_pool.asset0, removed_pool.asset1);
-
-                    let pool_key = PoolKey {
-                        currency1:   removed_pool.asset1,
-                        currency0:   removed_pool.asset0,
-                        fee:         removed_pool.feeInE6,
-                        tickSpacing: removed_pool.tickSpacing,
-                        hooks:       self.angstrom_address
-                    };
-                    self.send_events(EthEvent::RemovedPool { pool: pool_key });
-                }
-                if let Ok(added_pool) = PoolConfigured::decode_log(log, true) {
-                    let asset0 = added_pool.asset0;
-                    let asset1 = added_pool.asset1;
-                    let entry = AngPoolConfigEntry {
-                        pool_partial_key: AngstromPoolConfigStore::derive_store_key(asset0, asset1),
-                        tick_spacing:     added_pool.tickSpacing,
-                        fee_in_e6:        added_pool.feeInE6.to(),
-                        store_index:      self.pool_store.length()
-                    };
-
-                    let pool_key = PoolKey {
-                        currency1:   asset1,
-                        currency0:   asset0,
-                        fee:         added_pool.feeInE6,
-                        tickSpacing: I24::try_from_be_slice(&{
-                            let bytes = added_pool.tickSpacing.to_be_bytes();
-                            let mut a = [0u8; 3];
-                            a[1..3].copy_from_slice(&bytes);
-                            a
-                        })
-                        .unwrap(),
-                        hooks:       self.angstrom_address
-                    };
-
-                    self.pool_store.new_pool(asset0, asset1, entry);
-                    self.angstrom_tokens.insert(asset0);
-                    self.angstrom_tokens.insert(asset1);
-
-                    self.send_events(EthEvent::NewPool { pool: pool_key });
-                }
-            });
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn fetch_filled_order<'a>(
         &'a self,
         chain: &'a impl ChainExt
     ) -> impl Iterator<Item = B256> + 'a {
         chain
             .tip_transactions()

---- manager::test::test_periphery_pool_events stdout ----
thread 'manager::test::test_periphery_pool_events' panicked at crates/eth/src/manager.rs:555:9:
assertion failed: eth.angstrom_tokens.contains(&asset0)

---- manager::test::test_multiple_node_changes stdout ----
thread 'manager::test::test_multiple_node_changes' panicked at crates/eth/src/manager.rs:786:9:
assertion failed: eth.node_set.contains(&node3)

---- manager::test::test_pool_config_edge_cases stdout ----
thread 'manager::test::test_pool_config_edge_cases' panicked at crates/eth/src/manager.rs:829:9:
assertion failed: eth.angstrom_tokens.contains(&asset0)

failures:
    manager::test::test_multiple_node_changes
    manager::test::test_periphery_pool_events
    manager::test::test_pool_config_edge_cases

test result: FAILED. 12 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
