*** crates/eth/src/manager.rs:192:39: replace == with != in EthDataCleanser<Sync>::apply_periphery_logs

*** mutation diff:
--- crates/eth/src/manager.rs
+++ replace == with != in EthDataCleanser<Sync>::apply_periphery_logs
@@ -184,17 +184,17 @@
     /// sending out info.
     fn apply_periphery_logs(&mut self, chain: &impl ChainExt) {
         let periphery_address = self.periphery_address;
         chain
             .receipts_by_block_hash(chain.tip_hash())
             .unwrap_or_default()
             .into_iter()
             .flat_map(|receipt| &receipt.logs)
-            .filter(|log| log.address == periphery_address)
+            .filter(|log| log.address != /* ~ changed by cargo-mutants ~ */ periphery_address)
             .for_each(|log| {
                 if let Ok(remove_node) = NodeRemoved::decode_log(log, true) {
                     self.node_set.remove(&remove_node.node);
                     self.send_events(EthEvent::RemovedNode(remove_node.node));
                 }
                 if let Ok(added_node) = NodeAdded::decode_log(log, true) {
                     self.node_set.insert(added_node.node);
                     self.send_events(EthEvent::AddedNode(added_node.node));

---- manager::test::test_periphery_pool_events stdout ----
thread 'manager::test::test_periphery_pool_events' panicked at crates/eth/src/manager.rs:614:9:
assertion failed: eth.angstrom_tokens.contains(&asset0)

---- manager::test::test_multiple_node_changes stdout ----
thread 'manager::test::test_multiple_node_changes' panicked at crates/eth/src/manager.rs:845:9:
assertion failed: eth.node_set.contains(&node3)

---- manager::test::test_pool_config_edge_cases stdout ----
thread 'manager::test::test_pool_config_edge_cases' panicked at crates/eth/src/manager.rs:888:9:
assertion failed: eth.angstrom_tokens.contains(&asset0)

failures:
    manager::test::test_multiple_node_changes
    manager::test::test_periphery_pool_events
    manager::test::test_pool_config_edge_cases

test result: FAILED. 12 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
