*** crates/eth/src/manager.rs:252:9: replace EthDataCleanser<Sync>::fetch_filled_order -> impl Iterator<Item = B256>+'a with ::std::iter::empty()

*** mutation diff:
--- crates/eth/src/manager.rs
+++ replace EthDataCleanser<Sync>::fetch_filled_order -> impl Iterator<Item = B256>+'a with ::std::iter::empty()
@@ -244,28 +244,17 @@
                 }
             });
     }
 
     fn fetch_filled_order<'a>(
         &'a self,
         chain: &'a impl ChainExt
     ) -> impl Iterator<Item = B256> + 'a {
-        chain
-            .tip_transactions()
-            .filter(|tx| tx.transaction.to() == Some(self.angstrom_address))
-            .filter_map(|transaction| {
-                let mut input: &[u8] = transaction.input();
-                AngstromBundle::pade_decode(&mut input, None).ok()
-            })
-            .flat_map(move |bundle| {
-                bundle
-                    .get_order_hashes(chain.tip_number())
-                    .collect::<Vec<_>>()
-            })
+        ::std::iter::empty() /* ~ changed by cargo-mutants ~ */
     }
 
     /// fetches all eoa addresses touched
     fn get_eoa(&self, chain: Arc<impl ChainExt>) -> Vec<Address> {
         chain
             .receipts_by_block_hash(chain.tip_hash())
             .unwrap_or_default()
             .into_iter()

---- manager::test::test_fetch_filled_orders stdout ----
thread 'manager::test::test_fetch_filled_orders' panicked at crates/eth/src/manager.rs:524:13:
assertion failed: filled_set.contains(&order_hash)

failures:
    manager::test::test_fetch_filled_orders

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
