*** crates/eth/src/manager.rs:252:9: replace EthDataCleanser<Sync>::fetch_filled_order -> impl Iterator<Item = B256>+'a with ::std::iter::once(Default::default())

*** mutation diff:
--- crates/eth/src/manager.rs
+++ replace EthDataCleanser<Sync>::fetch_filled_order -> impl Iterator<Item = B256>+'a with ::std::iter::once(Default::default())
@@ -244,28 +244,17 @@
                 }
             });
     }
 
     fn fetch_filled_order<'a>(
         &'a self,
         chain: &'a impl ChainExt
     ) -> impl Iterator<Item = B256> + 'a {
-        chain
-            .tip_transactions()
-            .filter(|tx| tx.transaction.to() == Some(self.angstrom_address))
-            .filter_map(|transaction| {
-                let mut input: &[u8] = transaction.input();
-                AngstromBundle::pade_decode(&mut input, None).ok()
-            })
-            .flat_map(move |bundle| {
-                bundle
-                    .get_order_hashes(chain.tip_number())
-                    .collect::<Vec<_>>()
-            })
+        ::std::iter::once(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// fetches all eoa addresses touched
     fn get_eoa(&self, chain: Arc<impl ChainExt>) -> Vec<Address> {
         chain
             .receipts_by_block_hash(chain.tip_hash())
             .unwrap_or_default()
             .into_iter()

---- manager::test::test_handle_commit stdout ----
thread 'manager::test::test_handle_commit' panicked at crates/eth/src/manager.rs:669:17:
assertion failed: filled_orders.is_empty()

---- manager::test::test_empty_block_handling stdout ----
thread 'manager::test::test_empty_block_handling' panicked at crates/eth/src/manager.rs:783:17:
assertion failed: filled_orders.is_empty()

---- manager::test::test_malformed_transaction_input stdout ----
thread 'manager::test::test_malformed_transaction_input' panicked at crates/eth/src/manager.rs:980:9:
assertion failed: filled_set.is_empty()

failures:
    manager::test::test_empty_block_handling
    manager::test::test_fetch_filled_orders
    manager::test::test_handle_commit
    manager::test::test_malformed_transaction_input

test result: FAILED. 11 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
