*** crates/eth/src/manager.rs:268:9: replace EthDataCleanser<Sync>::get_eoa -> Vec<Address> with vec![Default::default()]

*** mutation diff:
--- crates/eth/src/manager.rs
+++ replace EthDataCleanser<Sync>::get_eoa -> Vec<Address> with vec![Default::default()]
@@ -260,29 +260,17 @@
                 bundle
                     .get_order_hashes(chain.tip_number())
                     .collect::<Vec<_>>()
             })
     }
 
     /// fetches all eoa addresses touched
     fn get_eoa(&self, chain: Arc<impl ChainExt>) -> Vec<Address> {
-        chain
-            .receipts_by_block_hash(chain.tip_hash())
-            .unwrap_or_default()
-            .into_iter()
-            .flat_map(|receipt| &receipt.logs)
-            .filter(|log| self.angstrom_tokens.contains(&log.address))
-            .flat_map(|logs| {
-                Transfer::decode_log(logs, true)
-                    .map(|log| log._from)
-                    .or_else(|_| Approval::decode_log(logs, true).map(|log| log._owner))
-            })
-            .unique()
-            .collect()
+        vec![Default::default()] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl<Sync> Future for EthDataCleanser<Sync>
 where
     Sync: BlockSyncProducer
 {
     type Output = ();

---- manager::test::test_multiple_transfers_same_block stdout ----
thread 'manager::test::test_multiple_transfers_same_block' panicked at crates/eth/src/manager.rs:733:9:
assertion failed: eoas.contains(&addr1)

---- manager::test::test_handle_commit stdout ----
thread 'manager::test::test_handle_commit' panicked at crates/eth/src/manager.rs:669:17:
assertion failed: address_changeset.is_empty()

---- manager::test::test_fetch_eoa_balance_approval_changes stdout ----
thread 'manager::test::test_fetch_eoa_balance_approval_changes' panicked at crates/eth/src/manager.rs:702:13:
assertion failed: filled_set.contains(&change)

failures:
    manager::test::test_empty_block_handling
    manager::test::test_fetch_eoa_balance_approval_changes
    manager::test::test_handle_commit
    manager::test::test_multiple_transfers_same_block
    manager::test::test_non_angstrom_token_transfers

test result: FAILED. 10 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
