*** crates/eth/src/manager.rs:299:16: delete ! in <impl Future for EthDataCleanser<Sync>>::poll

*** mutation diff:
--- crates/eth/src/manager.rs
+++ delete ! in <impl Future for EthDataCleanser<Sync>>::poll
@@ -291,17 +291,17 @@
         // poll all canonical updates
         while let Poll::Ready(is_some) = self.canonical_updates.poll_next_unpin(cx).map(|res| {
             res.transpose()
                 .ok()
                 .flatten()
                 .map(|update| self.on_canon_update(update))
                 .is_some()
         }) {
-            if !is_some {
+            if  /* ~ changed by cargo-mutants ~ */is_some {
                 return Poll::Ready(())
             }
         }
 
         while let Poll::Ready(Some(command)) = self.commander.poll_next_unpin(cx) {
             self.on_command(command)
         }

*** result: Success
