*** crates/eth/src/manager.rs:351:25: replace - with + in <impl ChainExt for Chain>::reorged_range

*** mutation diff:
--- crates/eth/src/manager.rs
+++ replace - with + in <impl ChainExt for Chain>::reorged_range
@@ -343,17 +343,17 @@
 impl ChainExt for Chain {
     fn tip_hash(&self) -> BlockHash {
         self.tip().hash()
     }
 
     fn reorged_range(&self, new: impl ChainExt) -> Option<RangeInclusive<u64>> {
         let tip = new.tip_number();
         // search 150 blocks back;
-        let start = tip - MAX_REORG_DEPTH;
+        let start = tip + /* ~ changed by cargo-mutants ~ */ MAX_REORG_DEPTH;
 
         let mut range = self
             .blocks_iter()
             .filter(|b| b.block.number >= start)
             .zip(new.blocks_iter().filter(|b| b.block.number >= start))
             .filter(|&(old, new)| (old.block.hash() != new.block.hash()))
             .map(|(_, new)| new.block.number)
             .collect::<Vec<_>>();

*** result: Success
