*** crates/eth/src/manager.rs:355:40: replace >= with < in <impl ChainExt for Chain>::reorged_range

*** mutation diff:
--- crates/eth/src/manager.rs
+++ replace >= with < in <impl ChainExt for Chain>::reorged_range
@@ -347,17 +347,17 @@
 
     fn reorged_range(&self, new: impl ChainExt) -> Option<RangeInclusive<u64>> {
         let tip = new.tip_number();
         // search 150 blocks back;
         let start = tip - MAX_REORG_DEPTH;
 
         let mut range = self
             .blocks_iter()
-            .filter(|b| b.block.number >= start)
+            .filter(|b| b.block.number < /* ~ changed by cargo-mutants ~ */ start)
             .zip(new.blocks_iter().filter(|b| b.block.number >= start))
             .filter(|&(old, new)| (old.block.hash() != new.block.hash()))
             .map(|(_, new)| new.block.number)
             .collect::<Vec<_>>();
 
         match range.len() {
             0 => None,
             1 => {

*** result: Success
