*** crates/eth/src/manager.rs:376:9: replace <impl ChainExt for Chain>::blocks_iter -> impl Iterator<Item =&SealedBlockWithSenders>+'_ with ::std::iter::empty()

*** mutation diff:
--- crates/eth/src/manager.rs
+++ replace <impl ChainExt for Chain>::blocks_iter -> impl Iterator<Item =&SealedBlockWithSenders>+'_ with ::std::iter::empty()
@@ -368,17 +368,17 @@
                 let start = *range.first().unwrap();
                 let end = *range.last().unwrap();
                 Some(start..=end)
             }
         }
     }
 
     fn blocks_iter(&self) -> impl Iterator<Item = &SealedBlockWithSenders> + '_ {
-        self.blocks_iter()
+        ::std::iter::empty() /* ~ changed by cargo-mutants ~ */
     }
 
     fn tip_number(&self) -> BlockNumber {
         self.tip().number
     }
 
     fn receipts_by_block_hash(&self, block_hash: BlockHash) -> Option<Vec<&Receipt>> {
         self.receipts_by_block_hash(block_hash)

*** result: Success
