*** crates/eth/src/manager.rs:380:9: replace <impl ChainExt for Chain>::tip_number -> BlockNumber with Default::default()

*** mutation diff:
--- crates/eth/src/manager.rs
+++ replace <impl ChainExt for Chain>::tip_number -> BlockNumber with Default::default()
@@ -372,17 +372,17 @@
         }
     }
 
     fn blocks_iter(&self) -> impl Iterator<Item = &SealedBlockWithSenders> + '_ {
         self.blocks_iter()
     }
 
     fn tip_number(&self) -> BlockNumber {
-        self.tip().number
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     fn receipts_by_block_hash(&self, block_hash: BlockHash) -> Option<Vec<&Receipt>> {
         self.receipts_by_block_hash(block_hash)
     }
 
     fn tip_transactions(&self) -> impl Iterator<Item = &TransactionSigned> + '_ {
         self.tip().transactions().iter()

*** result: Success
