*** crates/eth/src/manager.rs:384:9: replace <impl ChainExt for Chain>::receipts_by_block_hash -> Option<Vec<&Receipt>> with None

*** mutation diff:
--- crates/eth/src/manager.rs
+++ replace <impl ChainExt for Chain>::receipts_by_block_hash -> Option<Vec<&Receipt>> with None
@@ -376,17 +376,17 @@
         self.blocks_iter()
     }
 
     fn tip_number(&self) -> BlockNumber {
         self.tip().number
     }
 
     fn receipts_by_block_hash(&self, block_hash: BlockHash) -> Option<Vec<&Receipt>> {
-        self.receipts_by_block_hash(block_hash)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     fn tip_transactions(&self) -> impl Iterator<Item = &TransactionSigned> + '_ {
         self.tip().transactions().iter()
     }
 }
 
 #[cfg(test)]

*** result: Success
