*** crates/eth/src/manager.rs:388:9: replace <impl ChainExt for Chain>::tip_transactions -> impl Iterator<Item =&TransactionSigned>+'_ with ::std::iter::empty()

*** mutation diff:
--- crates/eth/src/manager.rs
+++ replace <impl ChainExt for Chain>::tip_transactions -> impl Iterator<Item =&TransactionSigned>+'_ with ::std::iter::empty()
@@ -380,17 +380,17 @@
         self.tip().number
     }
 
     fn receipts_by_block_hash(&self, block_hash: BlockHash) -> Option<Vec<&Receipt>> {
         self.receipts_by_block_hash(block_hash)
     }
 
     fn tip_transactions(&self) -> impl Iterator<Item = &TransactionSigned> + '_ {
-        self.tip().transactions().iter()
+        ::std::iter::empty() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 pub mod test {
     use alloy::{
         hex,
         primitives::{aliases::U24, b256, Log, TxKind, U256},

*** result: Success
