*** crates/types/src/matching/composite.rs:109:19: replace + with - in CompositeOrder<'a>::quantity

*** mutation diff:
--- crates/types/src/matching/composite.rs
+++ replace + with - in CompositeOrder<'a>::quantity
@@ -101,17 +101,17 @@
             // providing less and less T0 so we subtract the `debt_q` from
             // the `amm_q` to determine how much T0 this composite order can
             // actually offer in liquidity
             amm_q.saturating_sub(debt_q)
         } else {
             // If the price is going down, we're selling T0 to the AMM and our debt will be
             // purchasing more and more T0 so we can just add the quantities
             // together to find the total liquidity consumed by both operations
-            amm_q + debt_q
+            amm_q - /* ~ changed by cargo-mutants ~ */ debt_q
         }
     }
 
     /// Specifically in the case that we are buying T0, there's a "negative
     /// quantity" - the amount of T0 that is required to be provided from an
     /// external source as the T0 provided by the debt decreases with a price
     /// motion.  If an AMM is moving along with the debt, we can see if it
     /// provides an amount of T0 that offsets the debt's negative quantity.

*** result: Success
