*** crates/types/src/matching/composite.rs:30:9: replace CompositeOrder<'a>::has_amm -> bool with true

*** mutation diff:
--- crates/types/src/matching/composite.rs
+++ replace CompositeOrder<'a>::has_amm -> bool with true
@@ -22,17 +22,17 @@
         Self { debt, amm, bound_price }
     }
 
     pub fn debt(&self) -> Option<&Debt> {
         self.debt.as_ref()
     }
 
     pub fn has_amm(&self) -> bool {
-        self.amm.is_some()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn has_debt(&self) -> bool {
         self.debt.is_some()
     }
 
     pub fn amm(&self) -> Option<&PoolPrice<'a>> {
         self.amm.as_ref()

*** result: Success
