*** crates/types/src/matching/composite.rs:34:9: replace CompositeOrder<'a>::has_debt -> bool with true

*** mutation diff:
--- crates/types/src/matching/composite.rs
+++ replace CompositeOrder<'a>::has_debt -> bool with true
@@ -26,17 +26,17 @@
         self.debt.as_ref()
     }
 
     pub fn has_amm(&self) -> bool {
         self.amm.is_some()
     }
 
     pub fn has_debt(&self) -> bool {
-        self.debt.is_some()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn amm(&self) -> Option<&PoolPrice<'a>> {
         self.amm.as_ref()
     }
 
     pub fn bound(&self) -> Option<Ray> {
         self.bound_price

*** result: Success
