*** crates/types/src/matching/composite.rs:67:9: replace CompositeOrder<'a>::find_closest_bound -> Ray with Default::default()

*** mutation diff:
--- crates/types/src/matching/composite.rs
+++ replace CompositeOrder<'a>::find_closest_bound -> Ray with Default::default()
@@ -59,28 +59,17 @@
         }
         if let Some(d) = self.debt.as_ref() {
             debug!(debt_price = ?d.price(), "Debt final stats");
         }
         (amm_q, debt_q)
     }
 
     fn find_closest_bound(&self, external_bound: Ray) -> Ray {
-        if let Some(ib) = self.bound_price {
-            let cur_price = self.start_price();
-            let external_dp = external_bound.abs_diff(*cur_price);
-            let internal_dp = ib.abs_diff(*cur_price);
-            if internal_dp < external_dp {
-                ib
-            } else {
-                external_bound
-            }
-        } else {
-            external_bound
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     fn debt_direction(&self, target_price: Ray) -> Option<Direction> {
         self.debt
             .map(|d| Direction::from_prices(d.price(), target_price))
     }
 
     /// Return the quantity of t0 available to fill from this order to the

---- matching::composite::tests::negative_quantities_are_zero stdout ----
thread 'matching::composite::tests::negative_quantities_are_zero' panicked at /Users/will/.cargo/registry/src/index.crates.io-6f17d22bba15001f/malachite-nz-0.4.16/src/natural/arithmetic/div_mod.rs:2298:36:
division by zero

---- matching::composite::tests::computes_quantities stdout ----
thread 'matching::composite::tests::computes_quantities' panicked at crates/types/src/matching/composite.rs:50:52:
called `Result::unwrap()` on an `Err` value: Second inequality must be < because the price can never reach the price at the max tick

Location:
    crates/types/src/matching/sqrtprice.rs:50:12

---- matching::composite::tests::restricts_quantities_to_bounds stdout ----
thread 'matching::composite::tests::restricts_quantities_to_bounds' panicked at crates/types/src/matching/composite.rs:50:52:
called `Result::unwrap()` on an `Err` value: Second inequality must be < because the price can never reach the price at the max tick

Location:
    crates/types/src/matching/sqrtprice.rs:50:12

failures:
    matching::composite::tests::computes_quantities
    matching::composite::tests::negative_quantities_are_zero
    matching::composite::tests::restricts_quantities_to_bounds

test result: FAILED. 37 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
