*** crates/types/src/matching/composite.rs:71:28: replace < with == in CompositeOrder<'a>::find_closest_bound

*** mutation diff:
--- crates/types/src/matching/composite.rs
+++ replace < with == in CompositeOrder<'a>::find_closest_bound
@@ -63,17 +63,17 @@
         (amm_q, debt_q)
     }
 
     fn find_closest_bound(&self, external_bound: Ray) -> Ray {
         if let Some(ib) = self.bound_price {
             let cur_price = self.start_price();
             let external_dp = external_bound.abs_diff(*cur_price);
             let internal_dp = ib.abs_diff(*cur_price);
-            if internal_dp < external_dp {
+            if internal_dp == /* ~ changed by cargo-mutants ~ */ external_dp {
                 ib
             } else {
                 external_bound
             }
         } else {
             external_bound
         }
     }

---- matching::composite::tests::restricts_quantities_to_bounds stdout ----
thread 'matching::composite::tests::restricts_quantities_to_bounds' panicked at crates/types/src/matching/composite.rs:278:9:
CompositeOrder did not respect bound

failures:
    matching::composite::tests::restricts_quantities_to_bounds

test result: FAILED. 39 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
