*** crates/types/src/matching/debt.rs:107:89: replace - with + in <impl Add for DebtType>::add

*** mutation diff:
--- crates/types/src/matching/debt.rs
+++ replace - with + in <impl Add for DebtType>::add
@@ -99,17 +99,17 @@
     fn add(self, rhs: Self) -> Self::Output {
         match (self, rhs) {
             // Like types accumulate
             (Self::ExactIn(q_1), Self::ExactIn(q_2)) => Self::ExactIn(q_1 + q_2),
             (Self::ExactOut(q_1), Self::ExactOut(q_2)) => Self::ExactOut(q_1 + q_2),
             // Different types annihilate or maybe flip
             (Self::ExactIn(q_1), Self::ExactOut(q_2)) if q_2 > q_1 => Self::ExactOut(q_2 - q_1),
             (Self::ExactIn(q_1), Self::ExactOut(q_2)) => Self::ExactIn(q_1 - q_2),
-            (Self::ExactOut(q_1), Self::ExactIn(q_2)) if q_2 > q_1 => Self::ExactIn(q_2 - q_1),
+            (Self::ExactOut(q_1), Self::ExactIn(q_2)) if q_2 > q_1 => Self::ExactIn(q_2 + /* ~ changed by cargo-mutants ~ */ q_1),
             (Self::ExactOut(q_1), Self::ExactIn(q_2)) => Self::ExactOut(q_1 - q_2)
         }
     }
 }
 
 impl Sub<u128> for DebtType {
     type Output = Self;

*** result: Success
