*** crates/types/src/matching/debt.rs:149:9: replace Debt::magnitude -> u128 with 0

*** mutation diff:
--- crates/types/src/matching/debt.rs
+++ replace Debt::magnitude -> u128 with 0
@@ -141,17 +141,17 @@
 
     /// Creates a new Debt item at the price provided with the same quantity as
     /// the current Debt
     pub fn set_price(&self, new_price: Ray) -> Self {
         Self { cur_price: new_price, ..*self }
     }
 
     pub fn magnitude(&self) -> u128 {
-        self.magnitude.magnitude()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn price(&self) -> Ray {
         self.cur_price
     }
 
     /// Returns the additional T0 needed to increase a debt from a specific T1
     /// to another greater T1 count

---- matching::debt::test::debt_t0_magnitude_calculation stdout ----
thread 'matching::debt::test::debt_t0_magnitude_calculation' panicked at crates/types/src/matching/debt.rs:447:9:
ExactIn Debt magnitude is not as initialized

failures:
    matching::debt::test::debt_t0_magnitude_calculation

test result: FAILED. 39 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
