*** crates/types/src/matching/debt.rs:159:9: replace Debt::additional_t0_needed -> u128 with 0

*** mutation diff:
--- crates/types/src/matching/debt.rs
+++ replace Debt::additional_t0_needed -> u128 with 0
@@ -151,19 +151,17 @@
 
     pub fn price(&self) -> Ray {
         self.cur_price
     }
 
     /// Returns the additional T0 needed to increase a debt from a specific T1
     /// to another greater T1 count
     pub fn additional_t0_needed(&self, added_t1: u128) -> u128 {
-        let new_magnitude = self.magnitude + self.magnitude.same_type(added_t1);
-        let new_debt = Self { magnitude: new_magnitude, cur_price: self.cur_price };
-        new_debt.current_t0() - self.current_t0()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Does this debt exist on the bid side of the book?  A debt is on the bid
     /// side of the book when it's an ExactIn debt (i.e. I would like to pay 100
     /// T1 and get as many T0 as I can for that amount)
     pub fn bid_side(&self) -> bool {
         matches!(self.magnitude, DebtType::ExactIn(_))
     }

*** result: Success
