*** crates/types/src/matching/debt.rs:209:9: replace Debt::valid_for_price -> bool with false

*** mutation diff:
--- crates/types/src/matching/debt.rs
+++ replace Debt::valid_for_price -> bool with false
@@ -201,23 +201,17 @@
         let (low, high) = low_to_high(&current_price, &bound_price);
         (*low, *high)
     }
 
     /// Will return true if the price provided is equivalent to the current
     /// price of this debt due to the rounding innate to performing the actual
     /// transaction
     pub fn valid_for_price(&self, price: Ray) -> bool {
-        let (low, high) = self.price_range();
-        debug!(low = ?low, high = ?high, "Validating for price range");
-
-        match self.magnitude {
-            DebtType::ExactIn(_) => price > low && price <= high,
-            DebtType::ExactOut(_) => price >= low && price < high
-        }
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn validate_and_set_price(&mut self, price: Ray) -> bool {
         let res = self.valid_for_price(price);
         if res {
             self.cur_price = price;
         }
         res

*** result: Success
