*** crates/types/src/matching/debt.rs:214:51: replace && with || in Debt::valid_for_price

*** mutation diff:
--- crates/types/src/matching/debt.rs
+++ replace && with || in Debt::valid_for_price
@@ -206,17 +206,17 @@
     /// price of this debt due to the rounding innate to performing the actual
     /// transaction
     pub fn valid_for_price(&self, price: Ray) -> bool {
         let (low, high) = self.price_range();
         debug!(low = ?low, high = ?high, "Validating for price range");
 
         match self.magnitude {
             DebtType::ExactIn(_) => price > low && price <= high,
-            DebtType::ExactOut(_) => price >= low && price < high
+            DebtType::ExactOut(_) => price >= low || /* ~ changed by cargo-mutants ~ */ price < high
         }
     }
 
     pub fn validate_and_set_price(&mut self, price: Ray) -> bool {
         let res = self.valid_for_price(price);
         if res {
             self.cur_price = price;
         }

*** result: Success
