*** crates/types/src/matching/debt.rs:254:22: replace >= with < in Debt::freed_t1

*** mutation diff:
--- crates/types/src/matching/debt.rs
+++ replace >= with < in Debt::freed_t1
@@ -246,17 +246,17 @@
         i_t0.saturating_sub(f_t0)
     }
 
     /// Returns the amount of T1 that needs to be reallocated for a given change
     /// in a debt's T0 value
     pub fn freed_t1(&self, t0_change: u128) -> u128 {
         // The amount of T1 we can free from this is equal to the quantity of T1 used at
         // this price plus our slack
-        if t0_change >= self.current_t0() {
+        if t0_change < /* ~ changed by cargo-mutants ~ */ self.current_t0() {
             self.magnitude()
         } else {
             let discriminant = if self.bid_side() { 1_u128 } else { 0_u128 };
             let target_amount = t0_change.saturating_add(discriminant);
             let round_up = self.bid_side();
             std::cmp::min(
                 self.magnitude(),
                 self.price()

*** result: Success
