*** crates/types/src/matching/debt.rs:310:21: replace > with == in Debt::dq_to_price

*** mutation diff:
--- crates/types/src/matching/debt.rs
+++ replace > with == in Debt::dq_to_price
@@ -302,17 +302,17 @@
         Self { magnitude: new_t1, cur_price: self.cur_price }
     }
 
     /// Difference in t0 required to move the price from the current price to
     /// the target price
     pub fn dq_to_price(&self, target_price: &Ray) -> u128 {
         let final_t0 = self.magnitude.t0_at_price(*target_price);
         let current_t0: u128 = self.current_t0();
-        if final_t0 > current_t0 {
+        if final_t0 == /* ~ changed by cargo-mutants ~ */ current_t0 {
             final_t0 - current_t0
         } else {
             current_t0 - final_t0
         }
     }
 
     /// Given an AMM liquidity and a quantity of t0 being bought to or sold from
     /// the AMM, returns the quantity that t0 will change to bring the price

*** result: Success
