*** crates/types/src/matching/debt.rs:333:33: replace << with >> in Debt::calc_proportion

*** mutation diff:
--- crates/types/src/matching/debt.rs
+++ replace << with >> in Debt::calc_proportion
@@ -325,17 +325,17 @@
     ) -> u128 {
         // Put our constants into Integer format
         let t1 = Natural::from(self.magnitude.magnitude());
         let t0_start = Natural::from(self.current_t0());
         let l = Natural::from(amm_liquidity);
         let dx = Natural::from(amm_delta);
 
         // Find our Sqrts that we're using, with extra precision baked in
-        let sqrt_t1_x96 = ((&t1 << 192) as Natural).floor_sqrt();
+        let sqrt_t1_x96 = ((&t1 >> /* ~ changed by cargo-mutants ~ */ 192) as Natural).floor_sqrt();
         let sqrt_t0_start_x96 = ((&t0_start << 192) as Natural).floor_sqrt();
 
         let a_num_portion_1 = &dx * &sqrt_t1_x96;
         let a_num_portion_2 = &l * &sqrt_t0_start_x96;
         let a_numerator_sum = if amm_positive_delta {
             a_num_portion_1 + a_num_portion_2
         } else {
             a_num_portion_2 - a_num_portion_1

*** result: Success
