*** crates/types/src/matching/debt.rs:355:13: replace - with / in Debt::calc_proportion

*** mutation diff:
--- crates/types/src/matching/debt.rs
+++ replace - with / in Debt::calc_proportion
@@ -347,17 +347,17 @@
             denominator = ?l,
             result = ?&a_fraction,
             rounded = ?(&a_fraction >> 96),
             "Fraction calculation"
         );
 
         // if A = sqrt(x + dX) then we have to square A and subtract the original X
         let debt_delta_t0 = &t0_start
-            - &a_fraction
+            / /* ~ changed by cargo-mutants ~ */ &a_fraction
                 .pow(2)
                 .div_round(const_2_192(), RoundingMode::Ceiling)
                 .0;
         u128::saturating_from(&debt_delta_t0)
     }
 }
 
 impl Add<Debt> for Option<Debt> {

*** result: Success
