*** crates/types/src/matching/debt.rs:367:9: replace <impl Add for Option<Debt>>::add -> Self::Output with Default::default()

*** mutation diff:
--- crates/types/src/matching/debt.rs
+++ replace <impl Add for Option<Debt>>::add -> Self::Output with Default::default()
@@ -359,20 +359,17 @@
         u128::saturating_from(&debt_delta_t0)
     }
 }
 
 impl Add<Debt> for Option<Debt> {
     type Output = Option<Debt>;
 
     fn add(self, rhs: Debt) -> Self::Output {
-        match self {
-            None => Some(rhs),
-            Some(d) => d + rhs
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl AddAssign<Debt> for Option<Debt> {
     fn add_assign(&mut self, rhs: Debt) {
         *self = *self + rhs
     }
 }

*** result: Success
