*** crates/types/src/matching/debt.rs:376:9: replace <impl AddAssign for Option<Debt>>::add_assign with ()

*** mutation diff:
--- crates/types/src/matching/debt.rs
+++ replace <impl AddAssign for Option<Debt>>::add_assign with ()
@@ -368,17 +368,17 @@
             None => Some(rhs),
             Some(d) => d + rhs
         }
     }
 }
 
 impl AddAssign<Debt> for Option<Debt> {
     fn add_assign(&mut self, rhs: Debt) {
-        *self = *self + rhs
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Add<Debt> for Debt {
     type Output = Option<Debt>;
 
     fn add(self, rhs: Debt) -> Self::Output {
         let magnitude = self.magnitude + rhs.magnitude;

*** result: Success
