*** crates/types/src/matching/debt.rs:385:34: replace == with != in <impl Add for Debt>::add

*** mutation diff:
--- crates/types/src/matching/debt.rs
+++ replace == with != in <impl Add for Debt>::add
@@ -377,17 +377,17 @@
     }
 }
 
 impl Add<Debt> for Debt {
     type Output = Option<Debt>;
 
     fn add(self, rhs: Debt) -> Self::Output {
         let magnitude = self.magnitude + rhs.magnitude;
-        if magnitude.magnitude() == 0 {
+        if magnitude.magnitude() != /* ~ changed by cargo-mutants ~ */ 0 {
             return None
         }
         // If our new magnitude is on the same side, we stay at our price.  If we flip,
         // we flip to the other price
         let cur_price =
             if magnitude.same_side(&self.magnitude) { self.cur_price } else { rhs.cur_price };
         Some(Self { magnitude, cur_price })
     }

*** result: Success
