*** crates/types/src/matching/debt.rs:412:17: replace == with != in <impl PartialOrd for Debt>::partial_cmp

*** mutation diff:
--- crates/types/src/matching/debt.rs
+++ replace == with != in <impl PartialOrd for Debt>::partial_cmp
@@ -404,17 +404,17 @@
 impl PartialEq<Ray> for Debt {
     fn eq(&self, other: &Ray) -> bool {
         self.valid_for_price(*other)
     }
 }
 
 impl PartialOrd<Ray> for Debt {
     fn partial_cmp(&self, other: &Ray) -> Option<std::cmp::Ordering> {
-        if self == other {
+        if self != /* ~ changed by cargo-mutants ~ */ other {
             Some(std::cmp::Ordering::Equal)
         } else {
             Some(self.price().cmp(other))
         }
     }
 }
 
 impl<'a> PartialEq<PoolPrice<'a>> for Debt {

*** result: Success
