*** crates/types/src/matching/debt.rs:412:9: replace <impl PartialOrd for Debt>::partial_cmp -> Option<std::cmp::Ordering> with None

*** mutation diff:
--- crates/types/src/matching/debt.rs
+++ replace <impl PartialOrd for Debt>::partial_cmp -> Option<std::cmp::Ordering> with None
@@ -404,21 +404,17 @@
 impl PartialEq<Ray> for Debt {
     fn eq(&self, other: &Ray) -> bool {
         self.valid_for_price(*other)
     }
 }
 
 impl PartialOrd<Ray> for Debt {
     fn partial_cmp(&self, other: &Ray) -> Option<std::cmp::Ordering> {
-        if self == other {
-            Some(std::cmp::Ordering::Equal)
-        } else {
-            Some(self.price().cmp(other))
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl<'a> PartialEq<PoolPrice<'a>> for Debt {
     fn eq(&self, other: &PoolPrice<'a>) -> bool {
         self.valid_for_price(other.as_ray())
     }
 }

*** result: Success
