*** crates/types/src/matching/debt.rs:428:17: replace == with != in <impl PartialOrd for Debt>::partial_cmp

*** mutation diff:
--- crates/types/src/matching/debt.rs
+++ replace == with != in <impl PartialOrd for Debt>::partial_cmp
@@ -420,17 +420,17 @@
 impl<'a> PartialEq<PoolPrice<'a>> for Debt {
     fn eq(&self, other: &PoolPrice<'a>) -> bool {
         self.valid_for_price(other.as_ray())
     }
 }
 
 impl<'a> PartialOrd<PoolPrice<'a>> for Debt {
     fn partial_cmp(&self, other: &PoolPrice<'a>) -> Option<std::cmp::Ordering> {
-        if self == other {
+        if self != /* ~ changed by cargo-mutants ~ */ other {
             Some(std::cmp::Ordering::Equal)
         } else {
             Some(self.price().cmp(&other.as_ray()))
         }
     }
 }
 
 #[cfg(test)]

*** result: Success
