*** crates/types/src/matching/math/mod.rs:122:61: replace << with >> in price_intersect_solve

*** mutation diff:
--- crates/types/src/matching/math/mod.rs
+++ replace << with >> in price_intersect_solve
@@ -114,17 +114,17 @@
     let amm_sqrt_price_x96 = Integer::from(Natural::from_limbs_asc(amm_price.as_limbs()));
     let debt_magnitude = Integer::from(debt_fixed_t1);
 
     // The precision we want to use for this operation, depending on our common
     // values we might need to adjust this
     let precision: usize = 192;
 
     // a = 1/L^2
-    let a_frac = Rational::from_integers_ref(&(Integer::ONE << precision), &l_squared);
+    let a_frac = Rational::from_integers_ref(&(Integer::ONE >> /* ~ changed by cargo-mutants ~ */ precision), &l_squared);
     let a = Integer::rounding_from(a_frac, RoundingMode::Nearest).0;
     debug!(a = ?a, "A factor");
 
     // b = [ 2/(L*sqrt(Pa)) - 1/(T1d) ]
     let b_first_part = Rational::from_integers_ref(
         &(Integer::TWO << (96 + precision)),
         &(&l * &amm_sqrt_price_x96)
     );

*** result: Success
