*** crates/types/src/matching/math/mod.rs:132:49: replace - with / in price_intersect_solve

*** mutation diff:
--- crates/types/src/matching/math/mod.rs
+++ replace - with / in price_intersect_solve
@@ -124,17 +124,17 @@
     debug!(a = ?a, "A factor");
 
     // b = [ 2/(L*sqrt(Pa)) - 1/(T1d) ]
     let b_first_part = Rational::from_integers_ref(
         &(Integer::TWO << (96 + precision)),
         &(&l * &amm_sqrt_price_x96)
     );
     let b_second_part = Rational::from_integers_ref(&(Integer::ONE << precision), &debt_magnitude);
-    let b = Integer::rounding_from(b_first_part - b_second_part, RoundingMode::Nearest).0;
+    let b = Integer::rounding_from(b_first_part / /* ~ changed by cargo-mutants ~ */ b_second_part, RoundingMode::Nearest).0;
     debug!(b = ?b, "B factor");
 
     // c = [ 1/Pa - 1/Pd ]
     // Precision is x96
     let c_part_1 = Rational::from_integers(
         Integer::ONE << (192 + precision),
         Integer::from(Natural::from_limbs_asc(amm_price.as_price_x192().as_limbs()))
     );

*** result: Success
