*** crates/types/src/matching/math/mod.rs:138:30: replace + with - in price_intersect_solve

*** mutation diff:
--- crates/types/src/matching/math/mod.rs
+++ replace + with - in price_intersect_solve
@@ -130,17 +130,17 @@
     );
     let b_second_part = Rational::from_integers_ref(&(Integer::ONE << precision), &debt_magnitude);
     let b = Integer::rounding_from(b_first_part - b_second_part, RoundingMode::Nearest).0;
     debug!(b = ?b, "B factor");
 
     // c = [ 1/Pa - 1/Pd ]
     // Precision is x96
     let c_part_1 = Rational::from_integers(
-        Integer::ONE << (192 + precision),
+        Integer::ONE << (192 - /* ~ changed by cargo-mutants ~ */ precision),
         Integer::from(Natural::from_limbs_asc(amm_price.as_price_x192().as_limbs()))
     );
     // Precision is x96
     let c_part_2 = Rational::from_integers(
         (Integer::ONE * Integer::from(const_1e27())) << precision,
         Integer::from(Natural::from_limbs_asc(debt_price.as_limbs()))
     );
     let c = Integer::rounding_from(c_part_1 - c_part_2, RoundingMode::Nearest).0;

*** result: Success
