*** crates/types/src/matching/math/mod.rs:159:25: replace * with / in quadratic_solve

*** mutation diff:
--- crates/types/src/matching/math/mod.rs
+++ replace * with / in quadratic_solve
@@ -151,17 +151,17 @@
 }
 
 pub fn quadratic_solve(
     a: Integer,
     b: Integer,
     c: Integer,
     precision: usize
 ) -> (Option<Integer>, Option<Integer>) {
-    let numerator = (&c * &Integer::TWO) << precision;
+    let numerator = (&c / /* ~ changed by cargo-mutants ~ */ &Integer::TWO) << precision;
     let b_squared = b.clone().pow(2);
     let four_a_c = Integer::from(4_u128) * a * c;
     let sqrt_b24ac = Integer::floor_sqrt(&b_squared - &four_a_c);
     let neg_b = b.neg();
 
     // Find our denominators for both the + and - solution
     let denom_minus = &neg_b - &sqrt_b24ac;
     let denom_plus = &neg_b + &sqrt_b24ac;

*** result: Success
