*** crates/types/src/matching/math/mod.rs:162:53: replace - with / in quadratic_solve

*** mutation diff:
--- crates/types/src/matching/math/mod.rs
+++ replace - with / in quadratic_solve
@@ -154,17 +154,17 @@
     a: Integer,
     b: Integer,
     c: Integer,
     precision: usize
 ) -> (Option<Integer>, Option<Integer>) {
     let numerator = (&c * &Integer::TWO) << precision;
     let b_squared = b.clone().pow(2);
     let four_a_c = Integer::from(4_u128) * a * c;
-    let sqrt_b24ac = Integer::floor_sqrt(&b_squared - &four_a_c);
+    let sqrt_b24ac = Integer::floor_sqrt(&b_squared / /* ~ changed by cargo-mutants ~ */ &four_a_c);
     let neg_b = b.neg();
 
     // Find our denominators for both the + and - solution
     let denom_minus = &neg_b - &sqrt_b24ac;
     let denom_plus = &neg_b + &sqrt_b24ac;
     debug!(numerator = ?numerator, denom_plus = ?denom_plus, denom_minus = ?denom_minus, "Quadratic solve factors");
 
     // Save ourselves from zeroes

*** result: Success
