*** crates/types/src/matching/math/mod.rs:167:29: replace + with * in quadratic_solve

*** mutation diff:
--- crates/types/src/matching/math/mod.rs
+++ replace + with * in quadratic_solve
@@ -159,17 +159,17 @@
     let numerator = (&c * &Integer::TWO) << precision;
     let b_squared = b.clone().pow(2);
     let four_a_c = Integer::from(4_u128) * a * c;
     let sqrt_b24ac = Integer::floor_sqrt(&b_squared - &four_a_c);
     let neg_b = b.neg();
 
     // Find our denominators for both the + and - solution
     let denom_minus = &neg_b - &sqrt_b24ac;
-    let denom_plus = &neg_b + &sqrt_b24ac;
+    let denom_plus = &neg_b * /* ~ changed by cargo-mutants ~ */ &sqrt_b24ac;
     debug!(numerator = ?numerator, denom_plus = ?denom_plus, denom_minus = ?denom_minus, "Quadratic solve factors");
 
     // Save ourselves from zeroes
     match (denom_plus == Integer::ZERO, denom_minus == Integer::ZERO) {
         (true, true) => panic!("Both denominators in quadratic solve were zero, this math sucks"),
         // Just one that's valid, return that
         (false, true) => (None, Some(numerator.div_round(&denom_plus, RoundingMode::Nearest).0)),
         // Just one that's valid, return that

*** result: Success
