*** crates/types/src/matching/math/mod.rs:171:53: replace == with != in quadratic_solve

*** mutation diff:
--- crates/types/src/matching/math/mod.rs
+++ replace == with != in quadratic_solve
@@ -163,17 +163,17 @@
     let neg_b = b.neg();
 
     // Find our denominators for both the + and - solution
     let denom_minus = &neg_b - &sqrt_b24ac;
     let denom_plus = &neg_b + &sqrt_b24ac;
     debug!(numerator = ?numerator, denom_plus = ?denom_plus, denom_minus = ?denom_minus, "Quadratic solve factors");
 
     // Save ourselves from zeroes
-    match (denom_plus == Integer::ZERO, denom_minus == Integer::ZERO) {
+    match (denom_plus == Integer::ZERO, denom_minus != /* ~ changed by cargo-mutants ~ */ Integer::ZERO) {
         (true, true) => panic!("Both denominators in quadratic solve were zero, this math sucks"),
         // Just one that's valid, return that
         (false, true) => (None, Some(numerator.div_round(&denom_plus, RoundingMode::Nearest).0)),
         // Just one that's valid, return that
         (true, false) => (Some(numerator.div_round(&denom_minus, RoundingMode::Nearest).0), None),
         // Both valid, compare and return the best option
         (false, false) => {
             let answer_plus = numerator

*** result: Success
