*** crates/types/src/matching/math/mod.rs:44:68: replace << with >> in amm_debt_same_move_solve

*** mutation diff:
--- crates/types/src/matching/math/mod.rs
+++ replace << with >> in amm_debt_same_move_solve
@@ -36,17 +36,17 @@
     let l_squared = (&l).pow(2);
 
     // The precision we want to use for this operation, depending on our common
     // values we might need to adjust this
     let precision: usize = 192;
 
     // a = T1d / L^2
     let a_frac =
-        Rational::from_integers_ref(&(Integer::from(debt_fixed_t1) << precision), &l_squared);
+        Rational::from_integers_ref(&(Integer::from(debt_fixed_t1) >> /* ~ changed by cargo-mutants ~ */ precision), &l_squared);
     let a = Integer::rounding_from(a_frac, RoundingMode::Nearest).0;
 
     debug!(a = ?a, "A factor");
 
     // b = 2(sqrt(t0Debt * t1Debt)/L) + 1
     let dt0 = Integer::from(debt_initial_t0) << precision;
     let dt1 = Integer::from(debt_fixed_t1) << precision;
     let mul_debt = dt0 * dt1;

*** result: Success
