*** crates/types/src/matching/math/mod.rs:51:44: replace << with >> in amm_debt_same_move_solve

*** mutation diff:
--- crates/types/src/matching/math/mod.rs
+++ replace << with >> in amm_debt_same_move_solve
@@ -43,17 +43,17 @@
     let a_frac =
         Rational::from_integers_ref(&(Integer::from(debt_fixed_t1) << precision), &l_squared);
     let a = Integer::rounding_from(a_frac, RoundingMode::Nearest).0;
 
     debug!(a = ?a, "A factor");
 
     // b = 2(sqrt(t0Debt * t1Debt)/L) + 1
     let dt0 = Integer::from(debt_initial_t0) << precision;
-    let dt1 = Integer::from(debt_fixed_t1) << precision;
+    let dt1 = Integer::from(debt_fixed_t1) >> /* ~ changed by cargo-mutants ~ */ precision;
     let mul_debt = dt0 * dt1;
     let sqrt_debt = mul_debt.floor_sqrt();
     let debt_numerator = (Integer::TWO * sqrt_debt) + (l.clone() << precision);
     let b = debt_numerator.div_round(l, RoundingMode::Nearest).0;
     // let debt_numerator = ((Integer::from(debt_initial_t0) *
     // Integer::from(debt_fixed_t1))     << (precision * 2))
     //     .floor_sqrt()
     //     * Integer::TWO;

*** result: Success
