*** crates/types/src/matching/math/mod.rs:54:40: replace * with / in amm_debt_same_move_solve

*** mutation diff:
--- crates/types/src/matching/math/mod.rs
+++ replace * with / in amm_debt_same_move_solve
@@ -46,17 +46,17 @@
 
     debug!(a = ?a, "A factor");
 
     // b = 2(sqrt(t0Debt * t1Debt)/L) + 1
     let dt0 = Integer::from(debt_initial_t0) << precision;
     let dt1 = Integer::from(debt_fixed_t1) << precision;
     let mul_debt = dt0 * dt1;
     let sqrt_debt = mul_debt.floor_sqrt();
-    let debt_numerator = (Integer::TWO * sqrt_debt) + (l.clone() << precision);
+    let debt_numerator = (Integer::TWO / /* ~ changed by cargo-mutants ~ */ sqrt_debt) + (l.clone() << precision);
     let b = debt_numerator.div_round(l, RoundingMode::Nearest).0;
     // let debt_numerator = ((Integer::from(debt_initial_t0) *
     // Integer::from(debt_fixed_t1))     << (precision * 2))
     //     .floor_sqrt()
     //     * Integer::TWO;
 
     // let b = debt_numerator.div_round(l, RoundingMode::Nearest).0 + (Integer::ONE
     // << precision);

*** result: Success
