*** crates/types/src/matching/math/mod.rs:54:66: replace << with >> in amm_debt_same_move_solve

*** mutation diff:
--- crates/types/src/matching/math/mod.rs
+++ replace << with >> in amm_debt_same_move_solve
@@ -46,17 +46,17 @@
 
     debug!(a = ?a, "A factor");
 
     // b = 2(sqrt(t0Debt * t1Debt)/L) + 1
     let dt0 = Integer::from(debt_initial_t0) << precision;
     let dt1 = Integer::from(debt_fixed_t1) << precision;
     let mul_debt = dt0 * dt1;
     let sqrt_debt = mul_debt.floor_sqrt();
-    let debt_numerator = (Integer::TWO * sqrt_debt) + (l.clone() << precision);
+    let debt_numerator = (Integer::TWO * sqrt_debt) + (l.clone() >> /* ~ changed by cargo-mutants ~ */ precision);
     let b = debt_numerator.div_round(l, RoundingMode::Nearest).0;
     // let debt_numerator = ((Integer::from(debt_initial_t0) *
     // Integer::from(debt_fixed_t1))     << (precision * 2))
     //     .floor_sqrt()
     //     * Integer::TWO;
 
     // let b = debt_numerator.div_round(l, RoundingMode::Nearest).0 + (Integer::ONE
     // << precision);

---- matching::math::tests::debt_same_move_solve_test stdout ----
Debt initial T0: 454227
thread 'matching::math::tests::debt_same_move_solve_test' panicked at /Users/will/.cargo/registry/src/index.crates.io-6f17d22bba15001f/malachite-nz-0.4.16/src/integer/arithmetic/sqrt.rs:133:13:
Cannot take square root of -1575364349653036381486795369143841834871884558048121718154183210381988761541429426367144747960708136040975

failures:
    matching::math::tests::debt_same_move_solve_test

test result: FAILED. 39 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
