*** crates/types/src/matching/math/mod.rs:74:7: replace << with >> in amm_debt_same_move_solve

*** mutation diff:
--- crates/types/src/matching/math/mod.rs
+++ replace << with >> in amm_debt_same_move_solve
@@ -66,17 +66,17 @@
     // c = -T
     let c = match direction {
         // If the market is selling T0 to us, then we are on the bid side.  T is negative so -T is
         // positive
         Direction::SellingT0 => Integer::from(quantity_moved),
         // If the market is buying T0 from us, then we are on the ask side.  T is positive so -T is
         // negative
         Direction::BuyingT0 => Integer::from(quantity_moved).neg()
-    } << precision;
+    } >> /* ~ changed by cargo-mutants ~ */ precision;
 
     debug!(c = ?c, "C factor");
 
     let solution = quadratic_solve(a, b, c, precision);
     println!("Got solutions: {:?}", solution);
     let answer = solution
         .0
         .filter(|i| match direction {

*** result: Success
