*** crates/types/src/matching/math/mod.rs:87:24: replace < with == in amm_debt_same_move_solve

*** mutation diff:
--- crates/types/src/matching/math/mod.rs
+++ replace < with == in amm_debt_same_move_solve
@@ -79,17 +79,17 @@
     println!("Got solutions: {:?}", solution);
     let answer = solution
         .0
         .filter(|i| match direction {
             Direction::BuyingT0 => *i <= Integer::ZERO,
             Direction::SellingT0 => *i >= Integer::ZERO
         })
         .map(|i| resolve_precision(precision, i, RoundingMode::Ceiling))
-        .filter(|i| *i < quantity_moved)
+        .filter(|i| *i == /* ~ changed by cargo-mutants ~ */ quantity_moved)
         .or(solution
             .1
             .filter(|i| match direction {
                 Direction::BuyingT0 => *i <= Integer::ZERO,
                 Direction::SellingT0 => *i >= Integer::ZERO
             })
             .map(|i| resolve_precision(precision, i, RoundingMode::Ceiling))
             .filter(|i| *i < quantity_moved))

*** result: Success
