*** crates/types/src/matching/mod.rs:72:21: replace + with * in <impl Add for MatchingPrice>::add

*** mutation diff:
--- crates/types/src/matching/mod.rs
+++ replace + with * in <impl Add for MatchingPrice>::add
@@ -64,17 +64,17 @@
         &self.0
     }
 }
 
 impl Add for MatchingPrice {
     type Output = Self;
 
     fn add(self, rhs: Self) -> Self::Output {
-        Self(self.0 + rhs.0)
+        Self(self.0 * /* ~ changed by cargo-mutants ~ */ rhs.0)
     }
 }
 
 impl From<SqrtPriceX96> for MatchingPrice {
     fn from(value: SqrtPriceX96) -> Self {
         Ray::from(value).into()
     }
 }

*** result: Success
