*** crates/types/src/matching/mod.rs:72:9: replace <impl Add for MatchingPrice>::add -> Self::Output with Default::default()

*** mutation diff:
--- crates/types/src/matching/mod.rs
+++ replace <impl Add for MatchingPrice>::add -> Self::Output with Default::default()
@@ -64,17 +64,17 @@
         &self.0
     }
 }
 
 impl Add for MatchingPrice {
     type Output = Self;
 
     fn add(self, rhs: Self) -> Self::Output {
-        Self(self.0 + rhs.0)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl From<SqrtPriceX96> for MatchingPrice {
     fn from(value: SqrtPriceX96) -> Self {
         Ray::from(value).into()
     }
 }

*** result: Success
