*** crates/types/src/matching/mod.rs:78:9: replace <impl From for MatchingPrice>::from -> Self with Default::default()

*** mutation diff:
--- crates/types/src/matching/mod.rs
+++ replace <impl From for MatchingPrice>::from -> Self with Default::default()
@@ -70,17 +70,17 @@
 
     fn add(self, rhs: Self) -> Self::Output {
         Self(self.0 + rhs.0)
     }
 }
 
 impl From<SqrtPriceX96> for MatchingPrice {
     fn from(value: SqrtPriceX96) -> Self {
-        Ray::from(value).into()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl From<Ray> for MatchingPrice {
     fn from(value: Ray) -> Self {
         Self(*value)
     }
 }

---- matching::tests::can_convert_sqrtpricex96 stdout ----
thread 'matching::tests::can_convert_sqrtpricex96' panicked at crates/types/src/matching/mod.rs:123:9:
assertion `left == right` failed
  left: 0
 right: 266545628208910335169827403496061862499831943924642624922840845571

failures:
    matching::tests::can_convert_sqrtpricex96

test result: FAILED. 39 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
