*** crates/types/src/matching/mod.rs:84:9: replace <impl From for MatchingPrice>::from -> Self with Default::default()

*** mutation diff:
--- crates/types/src/matching/mod.rs
+++ replace <impl From for MatchingPrice>::from -> Self with Default::default()
@@ -76,17 +76,17 @@
 impl From<SqrtPriceX96> for MatchingPrice {
     fn from(value: SqrtPriceX96) -> Self {
         Ray::from(value).into()
     }
 }
 
 impl From<Ray> for MatchingPrice {
     fn from(value: Ray) -> Self {
-        Self(*value)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl From<U256> for MatchingPrice {
     fn from(value: U256) -> Self {
         Self(value)
     }
 }

---- matching::tests::can_convert_ray stdout ----
thread 'matching::tests::can_convert_ray' panicked at crates/types/src/matching/mod.rs:113:9:
assertion `left == right` failed
  left: 0
 right: 92073513903972947232910550548884585933906575068174992746504344064173293746526

---- matching::tests::can_convert_sqrtpricex96 stdout ----
thread 'matching::tests::can_convert_sqrtpricex96' panicked at crates/types/src/matching/mod.rs:123:9:
assertion `left == right` failed
  left: 0
 right: 27486901131374227233720615028446867892872970452666941189709047601

failures:
    matching::tests::can_convert_ray
    matching::tests::can_convert_sqrtpricex96

test result: FAILED. 38 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
