*** crates/types/src/matching/mod.rs:90:9: replace <impl From for MatchingPrice>::from -> Self with Default::default()

*** mutation diff:
--- crates/types/src/matching/mod.rs
+++ replace <impl From for MatchingPrice>::from -> Self with Default::default()
@@ -82,17 +82,17 @@
 impl From<Ray> for MatchingPrice {
     fn from(value: Ray) -> Self {
         Self(*value)
     }
 }
 
 impl From<U256> for MatchingPrice {
     fn from(value: U256) -> Self {
-        Self(value)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use alloy::primitives::{U160, U256};
     use rand::{thread_rng, Rng};

*** result: Success
