*** crates/types/src/matching/sqrtprice.rs:40:9: replace SqrtPriceX96::at_tick -> eyre::Result<Self> with Ok(Default::default())

*** mutation diff:
--- crates/types/src/matching/sqrtprice.rs
+++ replace SqrtPriceX96::at_tick -> eyre::Result<Self> with Ok(Default::default())
@@ -32,17 +32,17 @@
 
     /// Convert a floating point price `P` into a SqrtPriceX96 `sqrt(P)`
     pub fn from_float_price(price: f64) -> Self {
         SqrtPriceX96(U160::from(price.sqrt() * (2.0_f64.pow(96))))
     }
 
     /// Produces the SqrtPriceX96 precisely at a given tick
     pub fn at_tick(tick: i32) -> eyre::Result<Self> {
-        Ok(Self::from(get_sqrt_ratio_at_tick(tick)?))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Produces the maximum SqrtPriceX96 valid for a given tick before we step
     /// forward into the next tick
     pub fn max_at_tick(tick: i32) -> eyre::Result<Self> {
         Ok(Self::from(get_sqrt_ratio_at_tick(tick + 1)?.saturating_sub(U256::from(1))))
     }

---- matching::composite::tests::computes_quantities stdout ----
thread 'matching::composite::tests::computes_quantities' panicked at crates/types/src/matching/composite.rs:230:46:
called `Result::unwrap()` on an `Err` value: Unable to get a tick from our current price 'SqrtPriceX96(0)'

Caused by:
    Second inequality must be < because the price can never reach the price at the max tick

Location:
    crates/types/src/matching/uniswap/poolsnapshot.rs:45:74

---- matching::composite::tests::can_be_constructed stdout ----
thread 'matching::composite::tests::can_be_constructed' panicked at crates/types/src/matching/composite.rs:230:46:
called `Result::unwrap()` on an `Err` value: Unable to get a tick from our current price 'SqrtPriceX96(0)'

Caused by:
    Second inequality must be < because the price can never reach the price at the max tick

Location:
    crates/types/src/matching/uniswap/poolsnapshot.rs:45:74

---- matching::composite::tests::restricts_quantities_to_bounds stdout ----
thread 'matching::composite::tests::restricts_quantities_to_bounds' panicked at crates/types/src/matching/composite.rs:230:46:
called `Result::unwrap()` on an `Err` value: Unable to get a tick from our current price 'SqrtPriceX96(0)'

Caused by:
    Second inequality must be < because the price can never reach the price at the max tick

Location:
    crates/types/src/matching/uniswap/poolsnapshot.rs:45:74

failures:
    matching::composite::tests::can_be_constructed
    matching::composite::tests::computes_quantities
    matching::composite::tests::negative_quantities_are_zero
    matching::composite::tests::restricts_quantities_to_bounds
    matching::math::tests::debt_same_move_solve_test
    matching::sqrtprice::tests::min_and_max_for_tick
    matching::uniswap::poolprice::test::can_buy_and_sell_t0
    matching::uniswap::poolpricevec::tests::can_construct_pricevec
    matching::uniswap::poolpricevec::tests::will_span_segments
    sol_bindings::ray::tests::inverts_properly

test result: FAILED. 30 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
