*** crates/types/src/matching/sqrtprice.rs:46:9: replace SqrtPriceX96::max_at_tick -> eyre::Result<Self> with Ok(Default::default())

*** mutation diff:
--- crates/types/src/matching/sqrtprice.rs
+++ replace SqrtPriceX96::max_at_tick -> eyre::Result<Self> with Ok(Default::default())
@@ -38,17 +38,17 @@
     /// Produces the SqrtPriceX96 precisely at a given tick
     pub fn at_tick(tick: i32) -> eyre::Result<Self> {
         Ok(Self::from(get_sqrt_ratio_at_tick(tick)?))
     }
 
     /// Produces the maximum SqrtPriceX96 valid for a given tick before we step
     /// forward into the next tick
     pub fn max_at_tick(tick: i32) -> eyre::Result<Self> {
-        Ok(Self::from(get_sqrt_ratio_at_tick(tick + 1)?.saturating_sub(U256::from(1))))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn to_tick(&self) -> eyre::Result<i32> {
         Ok(get_tick_at_sqrt_ratio(U256::from(self.0))?)
     }
 
     /// Squares this value with no loss of precision, returning a U320 that
     /// contains PriceX192

---- matching::sqrtprice::tests::min_and_max_for_tick stdout ----
thread 'matching::sqrtprice::tests::min_and_max_for_tick' panicked at crates/types/src/matching/sqrtprice.rs:112:56:
called `Result::unwrap()` on an `Err` value: R

failures:
    matching::sqrtprice::tests::min_and_max_for_tick

test result: FAILED. 39 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
