*** crates/types/src/matching/sqrtprice.rs:50:9: replace SqrtPriceX96::to_tick -> eyre::Result<i32> with Ok(0)

*** mutation diff:
--- crates/types/src/matching/sqrtprice.rs
+++ replace SqrtPriceX96::to_tick -> eyre::Result<i32> with Ok(0)
@@ -42,17 +42,17 @@
 
     /// Produces the maximum SqrtPriceX96 valid for a given tick before we step
     /// forward into the next tick
     pub fn max_at_tick(tick: i32) -> eyre::Result<Self> {
         Ok(Self::from(get_sqrt_ratio_at_tick(tick + 1)?.saturating_sub(U256::from(1))))
     }
 
     pub fn to_tick(&self) -> eyre::Result<i32> {
-        Ok(get_tick_at_sqrt_ratio(U256::from(self.0))?)
+        Ok(0) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Squares this value with no loss of precision, returning a U320 that
     /// contains PriceX192
     pub fn as_price_x192(&self) -> U320 {
         self.0.widening_mul(self.0)
     }
 }

---- matching::composite::tests::computes_quantities stdout ----
thread 'matching::composite::tests::computes_quantities' panicked at crates/types/src/matching/composite.rs:50:52:
called `Result::unwrap()` on an `Err` value: Ticks out of bounds, unable to construct step

Location:
    crates/types/src/matching/uniswap/poolpricevec.rs:62:24

---- matching::composite::tests::restricts_quantities_to_bounds stdout ----
thread 'matching::composite::tests::restricts_quantities_to_bounds' panicked at crates/types/src/matching/composite.rs:271:14:
called `Result::unwrap()` on an `Err` value: Ticks out of bounds, unable to construct step

Location:
    crates/types/src/matching/uniswap/poolpricevec.rs:62:24

---- matching::uniswap::poolprice::test::can_buy_and_sell_t0 stdout ----
thread 'matching::uniswap::poolprice::test::can_buy_and_sell_t0' panicked at crates/types/src/matching/uniswap/poolprice.rs:65:13:
Created PoolPrice with out of range tick!

failures:
    matching::composite::tests::computes_quantities
    matching::composite::tests::restricts_quantities_to_bounds
    matching::uniswap::poolprice::test::can_buy_and_sell_t0
    matching::uniswap::poolpricevec::tests::will_span_segments

test result: FAILED. 36 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
