*** crates/types/src/matching/sqrtprice.rs:56:9: replace SqrtPriceX96::as_price_x192 -> U320 with Default::default()

*** mutation diff:
--- crates/types/src/matching/sqrtprice.rs
+++ replace SqrtPriceX96::as_price_x192 -> U320 with Default::default()
@@ -48,17 +48,17 @@
 
     pub fn to_tick(&self) -> eyre::Result<i32> {
         Ok(get_tick_at_sqrt_ratio(U256::from(self.0))?)
     }
 
     /// Squares this value with no loss of precision, returning a U320 that
     /// contains PriceX192
     pub fn as_price_x192(&self) -> U320 {
-        self.0.widening_mul(self.0)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Deref for SqrtPriceX96 {
     type Target = U160;
 
     fn deref(&self) -> &Self::Target {
         &self.0

*** result: Success
