*** crates/types/src/matching/sqrtprice.rs:76:9: replace <impl From for SqrtPriceX96>::from -> Self with Default::default()

*** mutation diff:
--- crates/types/src/matching/sqrtprice.rs
+++ replace <impl From for SqrtPriceX96>::from -> Self with Default::default()
@@ -68,17 +68,17 @@
 impl From<SqrtPriceX96> for U256 {
     fn from(value: SqrtPriceX96) -> Self {
         Uint::from(value.0)
     }
 }
 
 impl From<U256> for SqrtPriceX96 {
     fn from(value: U256) -> Self {
-        Self(Uint::from(value))
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl From<U160> for SqrtPriceX96 {
     fn from(value: U160) -> Self {
         Self(value)
     }
 }

---- matching::composite::tests::computes_quantities stdout ----
thread 'matching::composite::tests::computes_quantities' panicked at crates/types/src/matching/composite.rs:230:46:
called `Result::unwrap()` on an `Err` value: Unable to get a tick from our current price 'SqrtPriceX96(0)'

Caused by:
    Second inequality must be < because the price can never reach the price at the max tick

Location:
    crates/types/src/matching/uniswap/poolsnapshot.rs:45:74

---- matching::composite::tests::can_be_constructed stdout ----
thread 'matching::composite::tests::can_be_constructed' panicked at crates/types/src/matching/composite.rs:230:46:
called `Result::unwrap()` on an `Err` value: Unable to get a tick from our current price 'SqrtPriceX96(0)'

Caused by:
    Second inequality must be < because the price can never reach the price at the max tick

Location:
    crates/types/src/matching/uniswap/poolsnapshot.rs:45:74

---- matching::composite::tests::restricts_quantities_to_bounds stdout ----
thread 'matching::composite::tests::restricts_quantities_to_bounds' panicked at crates/types/src/matching/composite.rs:230:46:
called `Result::unwrap()` on an `Err` value: Unable to get a tick from our current price 'SqrtPriceX96(0)'

Caused by:
    Second inequality must be < because the price can never reach the price at the max tick

Location:
    crates/types/src/matching/uniswap/poolsnapshot.rs:45:74

failures:
    matching::composite::tests::can_be_constructed
    matching::composite::tests::computes_quantities
    matching::composite::tests::negative_quantities_are_zero
    matching::composite::tests::restricts_quantities_to_bounds
    matching::math::tests::debt_same_move_solve_test
    matching::sqrtprice::tests::min_and_max_for_tick
    matching::uniswap::poolprice::test::can_buy_and_sell_t0
    matching::uniswap::poolpricevec::tests::can_construct_pricevec
    matching::uniswap::poolpricevec::tests::will_span_segments
    sol_bindings::ray::tests::inverts_properly

test result: FAILED. 30 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
