*** crates/types/src/matching/sqrtprice.rs:88:67: replace * with / in <impl From for SqrtPriceX96>::from

*** mutation diff:
--- crates/types/src/matching/sqrtprice.rs
+++ replace * with / in <impl From for SqrtPriceX96>::from
@@ -80,17 +80,17 @@
 impl From<U160> for SqrtPriceX96 {
     fn from(value: U160) -> Self {
         Self(value)
     }
 }
 
 impl From<Ray> for SqrtPriceX96 {
     fn from(value: Ray) -> Self {
-        let numerator = Natural::from_limbs_asc(value.as_limbs()) * const_2_192();
+        let numerator = Natural::from_limbs_asc(value.as_limbs()) / /* ~ changed by cargo-mutants ~ */ const_2_192();
         let (res, _) =
             numerator.div_round(const_1e27(), malachite::rounding_modes::RoundingMode::Ceiling);
         let root = res.ceiling_root(2);
         let reslimbs = root.into_limbs_asc();
         let output: U160 = Uint::from_limbs_slice(&reslimbs);
         Self(output)
     }
 }

---- matching::composite::tests::computes_quantities stdout ----
thread 'matching::composite::tests::computes_quantities' panicked at crates/types/src/matching/composite.rs:50:52:
called `Result::unwrap()` on an `Err` value: Second inequality must be < because the price can never reach the price at the max tick

Location:
    crates/types/src/matching/sqrtprice.rs:50:12

---- matching::composite::tests::restricts_quantities_to_bounds stdout ----
thread 'matching::composite::tests::restricts_quantities_to_bounds' panicked at crates/types/src/matching/composite.rs:50:52:
called `Result::unwrap()` on an `Err` value: Second inequality must be < because the price can never reach the price at the max tick

Location:
    crates/types/src/matching/sqrtprice.rs:50:12

failures:
    matching::composite::tests::computes_quantities
    matching::composite::tests::restricts_quantities_to_bounds

test result: FAILED. 38 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
