*** crates/types/src/matching/sqrtprice.rs:88:67: replace * with + in <impl From for SqrtPriceX96>::from

*** mutation diff:
--- crates/types/src/matching/sqrtprice.rs
+++ replace * with + in <impl From for SqrtPriceX96>::from
@@ -80,17 +80,17 @@
 impl From<U160> for SqrtPriceX96 {
     fn from(value: U160) -> Self {
         Self(value)
     }
 }
 
 impl From<Ray> for SqrtPriceX96 {
     fn from(value: Ray) -> Self {
-        let numerator = Natural::from_limbs_asc(value.as_limbs()) * const_2_192();
+        let numerator = Natural::from_limbs_asc(value.as_limbs()) + /* ~ changed by cargo-mutants ~ */ const_2_192();
         let (res, _) =
             numerator.div_round(const_1e27(), malachite::rounding_modes::RoundingMode::Ceiling);
         let root = res.ceiling_root(2);
         let reslimbs = root.into_limbs_asc();
         let output: U160 = Uint::from_limbs_slice(&reslimbs);
         Self(output)
     }
 }

---- sol_bindings::ray::tests::converts_from_sqrtpricex96 stdout ----
Ray(1) - Ray(1) - Ray(1)
SqrtPriceX96(2505414483949251) - SqrtPriceX96(2505414483750480) - SqrtPriceX96(2505414483750480)
0.0000000000000000000000000009999999999999999 - 0.0000000000000000000000000010000000001586737
thread 'sol_bindings::ray::tests::converts_from_sqrtpricex96' panicked at crates/types/src/sol_bindings/ray.rs:665:9:
assertion failed: rp.as_f64() == sp.as_f64()

---- matching::composite::tests::restricts_quantities_to_bounds stdout ----
thread 'matching::composite::tests::restricts_quantities_to_bounds' panicked at crates/types/src/matching/composite.rs:278:9:
CompositeOrder did not respect bound

failures:
    matching::composite::tests::restricts_quantities_to_bounds
    sol_bindings::ray::tests::converts_from_sqrtpricex96

test result: FAILED. 38 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
