*** crates/types/src/matching/tokens.rs:88:9: replace TokenQuantity::quantity -> u128 with 0

*** mutation diff:
--- crates/types/src/matching/tokens.rs
+++ replace TokenQuantity::quantity -> u128 with 0
@@ -80,19 +80,17 @@
     pub fn as_t1(&self, swap_price: Ray) -> Self {
         match self {
             Self::Token0(_) => self.swap_at_price(swap_price),
             Self::Token1(_) => *self
         }
     }
 
     pub fn quantity(&self) -> u128 {
-        match self {
-            Self::Token0(q) | Self::Token1(q) => *q
-        }
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn as_u256(&self) -> U256 {
         match self {
             Self::Token0(q) | Self::Token1(q) => U256::from(*q)
         }
     }
 }

*** result: Success
