*** crates/types/src/matching/tokens.rs:94:9: replace TokenQuantity::as_u256 -> U256 with Default::default()

*** mutation diff:
--- crates/types/src/matching/tokens.rs
+++ replace TokenQuantity::as_u256 -> U256 with Default::default()
@@ -86,13 +86,11 @@
 
     pub fn quantity(&self) -> u128 {
         match self {
             Self::Token0(q) | Self::Token1(q) => *q
         }
     }
 
     pub fn as_u256(&self) -> U256 {
-        match self {
-            Self::Token0(q) | Self::Token1(q) => U256::from(*q)
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
