*** crates/types/src/matching/uniswap/flags.rs:102:34: replace | with ^ in <impl BitOr for UniswapFlags>::bitor

*** mutation diff:
--- crates/types/src/matching/uniswap/flags.rs
+++ replace | with ^ in <impl BitOr for UniswapFlags>::bitor
@@ -94,11 +94,11 @@
         self | Into::<U160>::into(rhs)
     }
 }
 
 impl BitOr<U160> for UniswapFlags {
     type Output = U160;
 
     fn bitor(self, rhs: U160) -> Self::Output {
-        Into::<U160>::into(self) | rhs
+        Into::<U160>::into(self) ^ /* ~ changed by cargo-mutants ~ */ rhs
     }
 }

*** result: Success
