*** crates/types/src/matching/uniswap/flags.rs:102:9: replace <impl BitOr for UniswapFlags>::bitor -> Self::Output with Default::default()

*** mutation diff:
--- crates/types/src/matching/uniswap/flags.rs
+++ replace <impl BitOr for UniswapFlags>::bitor -> Self::Output with Default::default()
@@ -94,11 +94,11 @@
         self | Into::<U160>::into(rhs)
     }
 }
 
 impl BitOr<U160> for UniswapFlags {
     type Output = U160;
 
     fn bitor(self, rhs: U160) -> Self::Output {
-        Into::<U160>::into(self) | rhs
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
