*** crates/types/src/matching/uniswap/flags.rs:56:27: replace << with >> in UniswapFlags::mask

*** mutation diff:
--- crates/types/src/matching/uniswap/flags.rs
+++ replace << with >> in UniswapFlags::mask
@@ -48,17 +48,17 @@
     BeforeSwapReturnsDelta,
     AfterSwapReturnsDelta,
     AfterAddLiquidityReturnsDelta,
     AfterRemoveLiquidityReturnsDelta
 }
 
 impl UniswapFlags {
     pub fn mask() -> U160 {
-        (U160::from(1_u8) << 14) - U160::from(1_u8)
+        (U160::from(1_u8) >> /* ~ changed by cargo-mutants ~ */ 14) - U160::from(1_u8)
     }
 }
 
 impl From<UniswapFlags> for U160 {
     fn from(value: UniswapFlags) -> U160 {
         let bitshift: usize = match value {
             UniswapFlags::BeforeInitialize => 13,
             UniswapFlags::AfterInitialize => 12,

*** result: Success
