*** crates/types/src/matching/uniswap/flags.rs:56:9: replace UniswapFlags::mask -> U160 with Default::default()

*** mutation diff:
--- crates/types/src/matching/uniswap/flags.rs
+++ replace UniswapFlags::mask -> U160 with Default::default()
@@ -48,17 +48,17 @@
     BeforeSwapReturnsDelta,
     AfterSwapReturnsDelta,
     AfterAddLiquidityReturnsDelta,
     AfterRemoveLiquidityReturnsDelta
 }
 
 impl UniswapFlags {
     pub fn mask() -> U160 {
-        (U160::from(1_u8) << 14) - U160::from(1_u8)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl From<UniswapFlags> for U160 {
     fn from(value: UniswapFlags) -> U160 {
         let bitshift: usize = match value {
             UniswapFlags::BeforeInitialize => 13,
             UniswapFlags::AfterInitialize => 12,

*** result: Success
