*** crates/types/src/matching/uniswap/liqrange.rs:103:9: replace LiqRangeRef<'a>::end_tick -> Tick with Default::default()

*** mutation diff:
--- crates/types/src/matching/uniswap/liqrange.rs
+++ replace LiqRangeRef<'a>::end_tick -> Tick with Default::default()
@@ -95,20 +95,17 @@
             Direction::BuyingT0 => self.lower_tick,
             Direction::SellingT0 => self.upper_tick
         }
     }
 
     /// Returns the final tick in this liquidity range presuming the price
     /// starts
     pub fn end_tick(&self, direction: Direction) -> Tick {
-        match direction {
-            Direction::BuyingT0 => self.upper_tick,
-            Direction::SellingT0 => self.lower_tick
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// PoolPrice representing the start price of this liquidity bound
     pub fn start_price(&self, direction: Direction) -> PoolPrice<'a> {
         let tick = self.start_tick(direction);
         PoolPrice { tick, liq_range: *self, price: SqrtPriceX96::at_tick(tick).unwrap() }
     }

---- matching::uniswap::poolprice::test::can_buy_and_sell_t0 stdout ----
thread 'matching::uniswap::poolprice::test::can_buy_and_sell_t0' panicked at crates/types/src/matching/uniswap/poolprice.rs:65:13:
Created PoolPrice with out of range tick!

failures:
    matching::uniswap::poolprice::test::can_buy_and_sell_t0

test result: FAILED. 39 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
