*** crates/types/src/matching/uniswap/liqrange.rs:137:9: replace <impl Debug for LiqRangeRef<'a>>::fmt -> std::fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/types/src/matching/uniswap/liqrange.rs
+++ replace <impl Debug for LiqRangeRef<'a>>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -129,14 +129,11 @@
             Direction::BuyingT0 => self.pool_snap.get_range_for_tick(self.range.upper_tick),
             Direction::SellingT0 => self.pool_snap.get_range_for_tick(self.range.lower_tick - 1)
         }
     }
 }
 
 impl<'a> Debug for LiqRangeRef<'a> {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        let mut builder = f.debug_struct("LiqRangeRef");
-        builder.field("range", &self.range);
-        builder.field("range_idx", &self.range_idx);
-        builder.finish()
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
