*** crates/types/src/matching/uniswap/liqrange.rs:42:9: replace LiqRange::lower_tick -> i32 with 0

*** mutation diff:
--- crates/types/src/matching/uniswap/liqrange.rs
+++ replace LiqRange::lower_tick -> i32 with 0
@@ -34,17 +34,17 @@
         }
         if lower_tick < MIN_TICK {
             return Err(eyre!("Proposed lower tick '{}' out of valid tick range", lower_tick));
         }
         Ok(Self { lower_tick, upper_tick, liquidity })
     }
 
     pub fn lower_tick(&self) -> i32 {
-        self.lower_tick
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn upper_tick(&self) -> i32 {
         self.upper_tick
     }
 
     pub fn liquidity(&self) -> u128 {
         self.liquidity

*** result: Success
