*** crates/types/src/matching/uniswap/liqrange.rs:50:9: replace LiqRange::liquidity -> u128 with 1

*** mutation diff:
--- crates/types/src/matching/uniswap/liqrange.rs
+++ replace LiqRange::liquidity -> u128 with 1
@@ -42,17 +42,17 @@
         self.lower_tick
     }
 
     pub fn upper_tick(&self) -> i32 {
         self.upper_tick
     }
 
     pub fn liquidity(&self) -> u128 {
-        self.liquidity
+        1 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Copy, Clone)]
 pub struct LiqRangeRef<'a> {
     pub(super) pool_snap: &'a PoolSnapshot,
     pub(super) range:     &'a LiqRange,
     pub(super) range_idx: usize

---- matching::uniswap::poolprice::test::can_buy_and_sell_t0 stdout ----
thread 'matching::uniswap::poolprice::test::can_buy_and_sell_t0' panicked at crates/types/src/matching/uniswap/poolprice.rs:395:14:
called `Result::unwrap()` on an `Err` value: Bad stuff

Location:
    crates/types/src/matching/uniswap/poolprice.rs:143:40

failures:
    matching::uniswap::poolprice::test::can_buy_and_sell_t0

test result: FAILED. 39 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
