*** crates/types/src/matching/uniswap/liqrange.rs:71:9: replace <impl PartialEq for LiqRangeRef<'a>>::eq -> bool with false

*** mutation diff:
--- crates/types/src/matching/uniswap/liqrange.rs
+++ replace <impl PartialEq for LiqRangeRef<'a>>::eq -> bool with false
@@ -63,19 +63,17 @@
 
     fn deref(&self) -> &Self::Target {
         self.range
     }
 }
 
 impl<'a> PartialEq for LiqRangeRef<'a> {
     fn eq(&self, other: &Self) -> bool {
-        std::ptr::eq(self.pool_snap, other.pool_snap)
-            && std::ptr::eq(self.range, other.range)
-            && self.range_idx == other.range_idx
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl<'a> Eq for LiqRangeRef<'a> {}
 
 impl<'a> LiqRangeRef<'a> {
     pub fn new(market: &'a PoolSnapshot, range: &'a LiqRange, range_idx: usize) -> Self {
         Self { pool_snap: market, range, range_idx }

*** result: Success
