*** crates/types/src/matching/uniswap/liqrange.rs:72:13: replace && with || in <impl PartialEq for LiqRangeRef<'a>>::eq

*** mutation diff:
--- crates/types/src/matching/uniswap/liqrange.rs
+++ replace && with || in <impl PartialEq for LiqRangeRef<'a>>::eq
@@ -64,17 +64,17 @@
     fn deref(&self) -> &Self::Target {
         self.range
     }
 }
 
 impl<'a> PartialEq for LiqRangeRef<'a> {
     fn eq(&self, other: &Self) -> bool {
         std::ptr::eq(self.pool_snap, other.pool_snap)
-            && std::ptr::eq(self.range, other.range)
+            || /* ~ changed by cargo-mutants ~ */ std::ptr::eq(self.range, other.range)
             && self.range_idx == other.range_idx
     }
 }
 
 impl<'a> Eq for LiqRangeRef<'a> {}
 
 impl<'a> LiqRangeRef<'a> {
     pub fn new(market: &'a PoolSnapshot, range: &'a LiqRange, range_idx: usize) -> Self {

*** result: Success
