*** crates/types/src/matching/uniswap/liqrange.rs:73:31: replace == with != in <impl PartialEq for LiqRangeRef<'a>>::eq

*** mutation diff:
--- crates/types/src/matching/uniswap/liqrange.rs
+++ replace == with != in <impl PartialEq for LiqRangeRef<'a>>::eq
@@ -65,17 +65,17 @@
         self.range
     }
 }
 
 impl<'a> PartialEq for LiqRangeRef<'a> {
     fn eq(&self, other: &Self) -> bool {
         std::ptr::eq(self.pool_snap, other.pool_snap)
             && std::ptr::eq(self.range, other.range)
-            && self.range_idx == other.range_idx
+            && self.range_idx != /* ~ changed by cargo-mutants ~ */ other.range_idx
     }
 }
 
 impl<'a> Eq for LiqRangeRef<'a> {}
 
 impl<'a> LiqRangeRef<'a> {
     pub fn new(market: &'a PoolSnapshot, range: &'a LiqRange, range_idx: usize) -> Self {
         Self { pool_snap: market, range, range_idx }

*** result: Success
