*** crates/types/src/matching/uniswap/liqrange.rs:86:9: replace LiqRangeRef<'a>::price_in_range -> bool with true

*** mutation diff:
--- crates/types/src/matching/uniswap/liqrange.rs
+++ replace LiqRangeRef<'a>::price_in_range -> bool with true
@@ -78,21 +78,17 @@
 
 impl<'a> LiqRangeRef<'a> {
     pub fn new(market: &'a PoolSnapshot, range: &'a LiqRange, range_idx: usize) -> Self {
         Self { pool_snap: market, range, range_idx }
     }
 
     /// Determines if a given SqrtPriceX96 is within this liquidity range
     pub fn price_in_range(&self, price: SqrtPriceX96) -> bool {
-        if let Ok(price_tick) = price.to_tick() {
-            price_tick >= self.lower_tick && price_tick < self.upper_tick
-        } else {
-            false
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn start_tick(&self, direction: Direction) -> Tick {
         match direction {
             Direction::BuyingT0 => self.lower_tick,
             Direction::SellingT0 => self.upper_tick
         }
     }

*** result: Success
