*** crates/types/src/matching/uniswap/liqrange.rs:87:57: replace < with > in LiqRangeRef<'a>::price_in_range

*** mutation diff:
--- crates/types/src/matching/uniswap/liqrange.rs
+++ replace < with > in LiqRangeRef<'a>::price_in_range
@@ -79,17 +79,17 @@
 impl<'a> LiqRangeRef<'a> {
     pub fn new(market: &'a PoolSnapshot, range: &'a LiqRange, range_idx: usize) -> Self {
         Self { pool_snap: market, range, range_idx }
     }
 
     /// Determines if a given SqrtPriceX96 is within this liquidity range
     pub fn price_in_range(&self, price: SqrtPriceX96) -> bool {
         if let Ok(price_tick) = price.to_tick() {
-            price_tick >= self.lower_tick && price_tick < self.upper_tick
+            price_tick >= self.lower_tick && price_tick > /* ~ changed by cargo-mutants ~ */ self.upper_tick
         } else {
             false
         }
     }
 
     pub fn start_tick(&self, direction: Direction) -> Tick {
         match direction {
             Direction::BuyingT0 => self.lower_tick,

---- matching::composite::tests::restricts_quantities_to_bounds stdout ----
thread 'matching::composite::tests::restricts_quantities_to_bounds' panicked at crates/types/src/matching/composite.rs:271:14:
called `Result::unwrap()` on an `Err` value: Price outside liquidity range

Location:
    crates/types/src/matching/uniswap/poolpricevec.rs:122:24

---- matching::composite::tests::computes_quantities stdout ----
thread 'matching::composite::tests::computes_quantities' panicked at crates/types/src/matching/composite.rs:50:52:
called `Result::unwrap()` on an `Err` value: Price outside liquidity range

Location:
    crates/types/src/matching/uniswap/poolpricevec.rs:122:24

---- matching::uniswap::poolpricevec::tests::will_span_segments stdout ----
thread 'matching::uniswap::poolpricevec::tests::will_span_segments' panicked at crates/types/src/matching/uniswap/poolpricevec.rs:568:79:
called `Result::unwrap()` on an `Err` value: Price outside liquidity range

Location:
    crates/types/src/matching/uniswap/poolpricevec.rs:122:24

failures:
    matching::composite::tests::computes_quantities
    matching::composite::tests::restricts_quantities_to_bounds
    matching::uniswap::poolpricevec::tests::will_span_segments

test result: FAILED. 37 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
