*** crates/types/src/matching/uniswap/mod.rs:68:9: replace Direction::is_bid -> bool with false

*** mutation diff:
--- crates/types/src/matching/uniswap/mod.rs
+++ replace Direction::is_bid -> bool with false
@@ -60,17 +60,17 @@
     pub fn from_is_bid(is_bid: bool) -> Self {
         match is_bid {
             true => Self::BuyingT0,
             false => Self::SellingT0
         }
     }
 
     pub fn is_bid(&self) -> bool {
-        matches!(self, Self::BuyingT0)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Determine the direction of sale from a start and end price
     pub fn from_prices<P: Ord>(start: P, end: P) -> Self {
         match start.cmp(&end) {
             std::cmp::Ordering::Less => Self::BuyingT0,
             _ => Self::SellingT0
         }

*** result: Success
