*** crates/types/src/matching/uniswap/poolprice.rs:117:75: replace * with + in PoolPrice<'a>::d_t0

*** mutation diff:
--- crates/types/src/matching/uniswap/poolprice.rs
+++ replace * with + in PoolPrice<'a>::d_t0
@@ -109,17 +109,17 @@
                 // Otherwise we can use the one we started in because this is the first
                 // iteration
                 active_liq_range = Some(self.liq_range);
                 self.liq_range
             };
             let amount_remaining = match direction {
                 // T0 when buying T0 is exact out (represented as a negative number in
                 // compute_swap_step)
-                Direction::BuyingT0 => I256::unchecked_from(cur_quantity) * I256::MINUS_ONE,
+                Direction::BuyingT0 => I256::unchecked_from(cur_quantity) + /* ~ changed by cargo-mutants ~ */ I256::MINUS_ONE,
                 // T0 when selling T0 is exact in (represented as a positive number in
                 // compute_swap_step)
                 Direction::SellingT0 => I256::unchecked_from(cur_quantity)
             };
             debug!(
                 lower_tick = cur_liq_range.lower_tick,
                 upper_tick = cur_liq_range.upper_tick,
                 "Current liq range"

---- matching::uniswap::poolprice::test::can_buy_and_sell_t0 stdout ----
thread 'matching::uniswap::poolprice::test::can_buy_and_sell_t0' panicked at crates/types/src/matching/uniswap/poolprice.rs:395:14:
called `Result::unwrap()` on an `Err` value: Bad stuff

Location:
    crates/types/src/matching/uniswap/poolprice.rs:143:40

failures:
    matching::uniswap::poolprice::test::can_buy_and_sell_t0

test result: FAILED. 39 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
