*** crates/types/src/matching/uniswap/poolprice.rs:142:39: replace < with == in PoolPrice<'a>::d_t0

*** mutation diff:
--- crates/types/src/matching/uniswap/poolprice.rs
+++ replace < with == in PoolPrice<'a>::d_t0
@@ -134,17 +134,17 @@
                 0
             )?;
 
             // If we didn't hit our target and we didn't use all of our quantity then we've
             // hit a weird error
             if new_price != sqrt_ratio_current_x_96 {
                 match direction {
                     Direction::BuyingT0 => {
-                        if amount_out < cur_quantity {
+                        if amount_out == /* ~ changed by cargo-mutants ~ */ cur_quantity {
                             return Err(eyre!("Bad stuff"));
                         }
                     }
                     Direction::SellingT0 => {
                         if amount_in < cur_quantity {
                             return Err(eyre!("Bad stuff"));
                         }
                     }

---- matching::uniswap::poolprice::test::can_buy_and_sell_t0 stdout ----
thread 'matching::uniswap::poolprice::test::can_buy_and_sell_t0' panicked at crates/types/src/matching/uniswap/poolprice.rs:395:14:
called `Result::unwrap()` on an `Err` value: Bad stuff

Location:
    crates/types/src/matching/uniswap/poolprice.rs:143:40

failures:
    matching::uniswap::poolprice::test::can_buy_and_sell_t0

test result: FAILED. 39 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
