*** crates/types/src/matching/uniswap/poolprice.rs:147:38: replace < with == in PoolPrice<'a>::d_t0

*** mutation diff:
--- crates/types/src/matching/uniswap/poolprice.rs
+++ replace < with == in PoolPrice<'a>::d_t0
@@ -139,17 +139,17 @@
             if new_price != sqrt_ratio_current_x_96 {
                 match direction {
                     Direction::BuyingT0 => {
                         if amount_out < cur_quantity {
                             return Err(eyre!("Bad stuff"));
                         }
                     }
                     Direction::SellingT0 => {
-                        if amount_in < cur_quantity {
+                        if amount_in == /* ~ changed by cargo-mutants ~ */ cur_quantity {
                             return Err(eyre!("Bad stuff"));
                         }
                     }
                 }
             }
             debug!(next_price = ?new_price, amount_in = ?amount_in, amount_out = ?amount_out, "Settings after compute_swap_step");
             // Update our current quantity
             match direction {

---- matching::uniswap::poolprice::test::can_buy_and_sell_t0 stdout ----
thread 'matching::uniswap::poolprice::test::can_buy_and_sell_t0' panicked at crates/types/src/matching/uniswap/poolprice.rs:397:73:
called `Result::unwrap()` on an `Err` value: Bad stuff

Location:
    crates/types/src/matching/uniswap/poolprice.rs:148:40

failures:
    matching::uniswap::poolprice::test::can_buy_and_sell_t0

test result: FAILED. 39 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
