*** crates/types/src/matching/uniswap/poolprice.rs:156:53: replace -= with /= in PoolPrice<'a>::d_t0

*** mutation diff:
--- crates/types/src/matching/uniswap/poolprice.rs
+++ replace -= with /= in PoolPrice<'a>::d_t0
@@ -148,17 +148,17 @@
                             return Err(eyre!("Bad stuff"));
                         }
                     }
                 }
             }
             debug!(next_price = ?new_price, amount_in = ?amount_in, amount_out = ?amount_out, "Settings after compute_swap_step");
             // Update our current quantity
             match direction {
-                Direction::BuyingT0 => cur_quantity -= amount_out,
+                Direction::BuyingT0 => cur_quantity /= /* ~ changed by cargo-mutants ~ */ amount_out,
                 Direction::SellingT0 => cur_quantity -= amount_in
             }
             // Update our current price
             sqrt_ratio_current_x_96 = new_price;
         }
         // Convert our final elements into a new price element
         let price = SqrtPriceX96::from(sqrt_ratio_current_x_96);
         let tick = price.to_tick()?;

---- matching::uniswap::poolprice::test::can_buy_and_sell_t0 stdout ----
thread 'matching::uniswap::poolprice::test::can_buy_and_sell_t0' panicked at crates/types/src/matching/uniswap/poolprice.rs:395:14:
called `Result::unwrap()` on an `Err` value: Unable to find liquidity ranges that span the whole transaction

Location:
    crates/types/src/matching/uniswap/poolprice.rs:104:21

failures:
    matching::uniswap::poolprice::test::can_buy_and_sell_t0

test result: FAILED. 39 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
