*** crates/types/src/matching/uniswap/poolprice.rs:249:22: replace >= with < in PoolPrice<'a>::order_to_target

*** mutation diff:
--- crates/types/src/matching/uniswap/poolprice.rs
+++ replace >= with < in PoolPrice<'a>::order_to_target
@@ -241,17 +241,17 @@
             if buy {
                 // Buying from the market will raise the price, so if our target price is on the
                 // wrong side of our current price, we can't do this.
                 if p <= self.price {
                     return None;
                 }
             } else {
                 // Selling to the market will lower the price, so the same applies here
-                if p >= self.price {
+                if p < /* ~ changed by cargo-mutants ~ */ self.price {
                     return None;
                 }
             }
         }
 
         let mut new_range_idx = self.liq_range.range_idx;
         let mut pool = self.liq_range.range;
         let (mut tick_bound_price, next_tick) = if buy {

*** result: Success
