*** crates/types/src/matching/uniswap/poolprice.rs:307:9: replace PoolPrice<'a>::as_ray -> Ray with Default::default()

*** mutation diff:
--- crates/types/src/matching/uniswap/poolprice.rs
+++ replace PoolPrice<'a>::as_ray -> Ray with Default::default()
@@ -299,17 +299,17 @@
     }
 
     pub fn price(&self) -> &SqrtPriceX96 {
         &self.price
     }
 
     /// Return the current price as a Ray
     pub fn as_ray(&self) -> Ray {
-        Ray::from(self.price)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Return the current SqrtPriceX96 structure
     pub fn as_sqrtpricex96(&self) -> SqrtPriceX96 {
         self.price
     }
 
     /// Return the current price (NOT sqrt) as a float by calling SqrtPriceX86's

*** result: Success
