*** crates/types/src/matching/uniswap/poolprice.rs:340:9: replace <impl From for U256>::from -> Self with Default::default()

*** mutation diff:
--- crates/types/src/matching/uniswap/poolprice.rs
+++ replace <impl From for U256>::from -> Self with Default::default()
@@ -332,17 +332,17 @@
 
     fn sub(self, rhs: Quantity) -> Self::Output {
         PoolPriceVec::from_swap(self, rhs.as_output(), rhs)
     }
 }
 
 impl<'a> From<PoolPrice<'a>> for U256 {
     fn from(value: PoolPrice) -> Self {
-        value.price.into()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod test {
     use alloy_primitives::U160;
 
     use crate::matching::{

*** result: Success
