*** crates/types/src/matching/uniswap/poolprice.rs:52:9: replace <impl PartialOrd for PoolPrice<'a>>::partial_cmp -> Option<std::cmp::Ordering> with None

*** mutation diff:
--- crates/types/src/matching/uniswap/poolprice.rs
+++ replace <impl PartialOrd for PoolPrice<'a>>::partial_cmp -> Option<std::cmp::Ordering> with None
@@ -44,17 +44,17 @@
 impl<'a> PartialEq for PoolPrice<'a> {
     fn eq(&self, other: &Self) -> bool {
         self.price.eq(&other.price) && self.liq_range == other.liq_range
     }
 }
 
 impl<'a> PartialOrd for PoolPrice<'a> {
     fn partial_cmp(&self, other: &Self) -> Option<std::cmp::Ordering> {
-        Some(self.cmp(other))
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl<'a> Ord for PoolPrice<'a> {
     fn cmp(&self, other: &Self) -> std::cmp::Ordering {
         self.price.cmp(&other.price)
     }
 }

*** result: Success
