*** crates/types/src/matching/uniswap/poolprice.rs:67:58: replace != with == in PoolPrice<'a>::checked_new

*** mutation diff:
--- crates/types/src/matching/uniswap/poolprice.rs
+++ replace != with == in PoolPrice<'a>::checked_new
@@ -59,17 +59,17 @@
     }
 }
 
 impl<'a> PoolPrice<'a> {
     pub fn checked_new(liq_range: LiqRangeRef<'a>, price: SqrtPriceX96, tick: i32) -> Self {
         if tick < liq_range.lower_tick || tick > liq_range.upper_tick {
             panic!("Created PoolPrice with out of range tick!");
         }
-        if get_tick_at_sqrt_ratio(price.into()).unwrap() != tick {
+        if get_tick_at_sqrt_ratio(price.into()).unwrap() == /* ~ changed by cargo-mutants ~ */ tick {
             panic!("Created PoolPrice with price that doesn't match the given tick!");
         }
         Self { liq_range, price, tick }
     }
 
     pub fn tick(&self) -> Tick {
         self.tick
     }

---- matching::uniswap::poolprice::test::can_buy_and_sell_t0 stdout ----
thread 'matching::uniswap::poolprice::test::can_buy_and_sell_t0' panicked at crates/types/src/matching/uniswap/poolprice.rs:68:13:
Created PoolPrice with price that doesn't match the given tick!

failures:
    matching::uniswap::poolprice::test::can_buy_and_sell_t0

test result: FAILED. 39 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
