*** crates/types/src/matching/uniswap/poolprice.rs:74:9: replace PoolPrice<'a>::tick -> Tick with Default::default()

*** mutation diff:
--- crates/types/src/matching/uniswap/poolprice.rs
+++ replace PoolPrice<'a>::tick -> Tick with Default::default()
@@ -66,17 +66,17 @@
         }
         if get_tick_at_sqrt_ratio(price.into()).unwrap() != tick {
             panic!("Created PoolPrice with price that doesn't match the given tick!");
         }
         Self { liq_range, price, tick }
     }
 
     pub fn tick(&self) -> Tick {
-        self.tick
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn liquidity_range(&self) -> LiqRangeRef<'a> {
         self.liq_range
     }
 
     pub fn liquidity(&self) -> u128 {
         self.liq_range.liquidity

*** result: Success
