*** crates/types/src/matching/uniswap/poolpricevec.rs:121:12: delete ! in SwapStep<'a>::compute_info

*** mutation diff:
--- crates/types/src/matching/uniswap/poolpricevec.rs
+++ delete ! in SwapStep<'a>::compute_info
@@ -113,17 +113,17 @@
         // Make sure our prices are in the appropriate range.
         let (low_price, high_price) = low_to_high(&start_price, &end_price);
         // Low price is valid if it's within our liquidity range
         let low_price_valid = liq_range.price_in_range(*low_price);
         // High price is valid if it's either within our liquidity range or at the very
         // top of the liquidity range
         let high_price_valid = liq_range.price_in_range(*high_price)
             || *high_price == SqrtPriceX96::at_tick(liq_range.upper_tick).unwrap();
-        if !(low_price_valid && high_price_valid) {
+        if  /* ~ changed by cargo-mutants ~ */(low_price_valid && high_price_valid) {
             return Err(eyre!("Price outside liquidity range"))
         }
 
         let liquidity = liq_range.liquidity;
         let (round_0, round_1) = match Direction::from_prices(start_price, end_price) {
             Direction::BuyingT0 => (false, true),
             Direction::SellingT0 => (true, false)
         };

---- matching::composite::tests::restricts_quantities_to_bounds stdout ----
thread 'matching::composite::tests::restricts_quantities_to_bounds' panicked at crates/types/src/matching/composite.rs:271:14:
called `Result::unwrap()` on an `Err` value: Price outside liquidity range

Location:
    crates/types/src/matching/uniswap/poolpricevec.rs:122:24

---- matching::composite::tests::computes_quantities stdout ----
thread 'matching::composite::tests::computes_quantities' panicked at crates/types/src/matching/composite.rs:50:52:
called `Result::unwrap()` on an `Err` value: Price outside liquidity range

Location:
    crates/types/src/matching/uniswap/poolpricevec.rs:122:24

---- matching::uniswap::poolpricevec::tests::will_span_segments stdout ----
thread 'matching::uniswap::poolpricevec::tests::will_span_segments' panicked at crates/types/src/matching/uniswap/poolpricevec.rs:568:79:
called `Result::unwrap()` on an `Err` value: Price outside liquidity range

Location:
    crates/types/src/matching/uniswap/poolpricevec.rs:122:24

failures:
    matching::composite::tests::computes_quantities
    matching::composite::tests::restricts_quantities_to_bounds
    matching::uniswap::poolpricevec::tests::will_span_segments

test result: FAILED. 37 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
