*** crates/types/src/matching/uniswap/poolpricevec.rs:146:9: replace SwapStep<'a>::end_price -> SqrtPriceX96 with Default::default()

*** mutation diff:
--- crates/types/src/matching/uniswap/poolpricevec.rs
+++ replace SwapStep<'a>::end_price -> SqrtPriceX96 with Default::default()
@@ -138,17 +138,17 @@
         Ok(Self { start_price, end_price, d_t0, d_t1, liq_range })
     }
 
     pub fn start_price(&self) -> SqrtPriceX96 {
         self.start_price
     }
 
     pub fn end_price(&self) -> SqrtPriceX96 {
-        self.end_price
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn avg_price(&self) -> Ray {
         Ray::calc_price(U256::from(self.d_t0), U256::from(self.d_t1))
     }
 
     pub fn liquidity(&self) -> u128 {
         self.liq_range.liquidity

*** result: Success
