*** crates/types/src/matching/uniswap/poolpricevec.rs:150:9: replace SwapStep<'a>::avg_price -> Ray with Default::default()

*** mutation diff:
--- crates/types/src/matching/uniswap/poolpricevec.rs
+++ replace SwapStep<'a>::avg_price -> Ray with Default::default()
@@ -142,17 +142,17 @@
         self.start_price
     }
 
     pub fn end_price(&self) -> SqrtPriceX96 {
         self.end_price
     }
 
     pub fn avg_price(&self) -> Ray {
-        Ray::calc_price(U256::from(self.d_t0), U256::from(self.d_t1))
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn liquidity(&self) -> u128 {
         self.liq_range.liquidity
     }
 
     pub fn input(&self) -> u128 {
         if self.end_price > self.start_price {

*** result: Success
