*** crates/types/src/matching/uniswap/poolpricevec.rs:154:9: replace SwapStep<'a>::liquidity -> u128 with 1

*** mutation diff:
--- crates/types/src/matching/uniswap/poolpricevec.rs
+++ replace SwapStep<'a>::liquidity -> u128 with 1
@@ -146,17 +146,17 @@
         self.end_price
     }
 
     pub fn avg_price(&self) -> Ray {
         Ray::calc_price(U256::from(self.d_t0), U256::from(self.d_t1))
     }
 
     pub fn liquidity(&self) -> u128 {
-        self.liq_range.liquidity
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn input(&self) -> u128 {
         if self.end_price > self.start_price {
             self.d_t1
         } else {
             self.d_t0
         }

*** result: Success
