*** crates/types/src/matching/uniswap/poolpricevec.rs:158:27: replace > with < in SwapStep<'a>::input

*** mutation diff:
--- crates/types/src/matching/uniswap/poolpricevec.rs
+++ replace > with < in SwapStep<'a>::input
@@ -150,17 +150,17 @@
         Ray::calc_price(U256::from(self.d_t0), U256::from(self.d_t1))
     }
 
     pub fn liquidity(&self) -> u128 {
         self.liq_range.liquidity
     }
 
     pub fn input(&self) -> u128 {
-        if self.end_price > self.start_price {
+        if self.end_price < /* ~ changed by cargo-mutants ~ */ self.start_price {
             self.d_t1
         } else {
             self.d_t0
         }
     }
 
     pub fn output(&self) -> u128 {
         if self.end_price > self.start_price {

*** result: Success
