*** crates/types/src/matching/uniswap/poolpricevec.rs:158:9: replace SwapStep<'a>::input -> u128 with 0

*** mutation diff:
--- crates/types/src/matching/uniswap/poolpricevec.rs
+++ replace SwapStep<'a>::input -> u128 with 0
@@ -150,21 +150,17 @@
         Ray::calc_price(U256::from(self.d_t0), U256::from(self.d_t1))
     }
 
     pub fn liquidity(&self) -> u128 {
         self.liq_range.liquidity
     }
 
     pub fn input(&self) -> u128 {
-        if self.end_price > self.start_price {
-            self.d_t1
-        } else {
-            self.d_t0
-        }
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn output(&self) -> u128 {
         if self.end_price > self.start_price {
             self.d_t0
         } else {
             self.d_t1
         }

*** result: Success
