*** crates/types/src/matching/uniswap/poolpricevec.rs:166:27: replace > with < in SwapStep<'a>::output

*** mutation diff:
--- crates/types/src/matching/uniswap/poolpricevec.rs
+++ replace > with < in SwapStep<'a>::output
@@ -158,17 +158,17 @@
         if self.end_price > self.start_price {
             self.d_t1
         } else {
             self.d_t0
         }
     }
 
     pub fn output(&self) -> u128 {
-        if self.end_price > self.start_price {
+        if self.end_price < /* ~ changed by cargo-mutants ~ */ self.start_price {
             self.d_t0
         } else {
             self.d_t1
         }
     }
 }
 
 #[derive(Debug)]

*** result: Success
