*** crates/types/src/matching/uniswap/poolpricevec.rs:204:33: replace > with == in PoolPriceVec<'a>::input

*** mutation diff:
--- crates/types/src/matching/uniswap/poolpricevec.rs
+++ replace > with == in PoolPriceVec<'a>::input
@@ -196,17 +196,17 @@
     /// within a single liquidity position
     pub fn new(start_bound: PoolPrice<'a>, end_bound: PoolPrice<'a>) -> Self {
         let (d_t0, d_t1) =
             Self::delta_to_price(start_bound.price, end_bound.price, start_bound.liquidity());
         Self { start_bound, end_bound, d_t0, d_t1, steps: None }
     }
 
     pub fn input(&self) -> u128 {
-        if self.end_bound.price > self.start_bound.price {
+        if self.end_bound.price == /* ~ changed by cargo-mutants ~ */ self.start_bound.price {
             self.d_t1
         } else {
             self.d_t0
         }
     }
 
     pub fn output(&self) -> u128 {
         if self.end_bound.price > self.start_bound.price {

*** result: Success
