*** crates/types/src/matching/uniswap/poolpricevec.rs:308:12: delete ! in PoolPriceVec<'a>::from_swap

*** mutation diff:
--- crates/types/src/matching/uniswap/poolpricevec.rs
+++ delete ! in PoolPriceVec<'a>::from_swap
@@ -300,17 +300,17 @@
         let total_out = U256::from(q);
 
         let mut remaining = I256::try_from(q).wrap_err_with(|| {
             // Should be impossible
             format!("Quantity too large to convert u128 -> I256: {}", q)
         })?;
 
         // "Exact out" is calculated with a negative quantity
-        if !direction.is_input(&quantity) {
+        if  /* ~ changed by cargo-mutants ~ */direction.is_input(&quantity) {
             remaining *= I256::MINUS_ONE;
         }
 
         while remaining < I256::ZERO {
             // Update our current liquidiy range
             let liq_range =
                 current_liq_range.ok_or_else(|| eyre!("Unable to find next liquidity range"))?;
             // Compute our swap towards the appropriate end of our current liquidity bound

*** result: Success
