*** crates/types/src/matching/uniswap/poolpricevec.rs:407:36: replace -= with += in PoolPriceVec<'a>::donation

*** mutation diff:
--- crates/types/src/matching/uniswap/poolpricevec.rs
+++ replace -= with += in PoolPriceVec<'a>::donation
@@ -399,17 +399,17 @@
             // were sold at our target price
             let step_cost = d_price.mul_quantity(q_step);
 
             if remaining_donation >= step_cost {
                 // If we have enough bribe to pay the whole cost, allocate that and step forward
                 // to the next price gap
                 cur_q = q_step;
                 filled_price = target_price;
-                remaining_donation -= step_cost;
+                remaining_donation += /* ~ changed by cargo-mutants ~ */ step_cost;
             } else {
                 // If we don't have enough bribe to pay the whole cost, figure out where the
                 // target price winds up based on what we do have and end this iteration
                 if remaining_donation > U256::ZERO {
                     let partial_dprice = Ray::calc_price(q_step, remaining_donation);
                     filled_price += partial_dprice;
                 }
                 break

*** result: Success
