*** crates/types/src/matching/uniswap/poolpricevec.rs:430:52: replace - with + in PoolPriceVec<'a>::donation

*** mutation diff:
--- crates/types/src/matching/uniswap/poolpricevec.rs
+++ replace - with + in PoolPriceVec<'a>::donation
@@ -422,17 +422,17 @@
         let tick_donations: HashMap<Tick, U256> = steps
             .iter()
             //.filter_map(|(p_avg, _p_end, q_out, liq)| {
             .filter_map(|step| {
                 // We always donate to the lower tick of our liquidity range as that is the
                 // appropriate initialized tick to target
                 let tick_num = step.liq_range.lower_tick();
                 if filled_price > step.avg_price() {
-                    let tick_dprice = filled_price - step.avg_price();
+                    let tick_dprice = filled_price + /* ~ changed by cargo-mutants ~ */ step.avg_price();
                     let tick_reward = tick_dprice.mul_quantity(U256::from(step.output()));
                     if tick_reward > U256::ZERO {
                         total_donated += tick_reward;
                         Some((tick_num, tick_reward))
                     } else {
                         None
                     }
                 } else {

*** result: Success
