*** crates/types/src/matching/uniswap/poolpricevec.rs:432:36: replace > with < in PoolPriceVec<'a>::donation

*** mutation diff:
--- crates/types/src/matching/uniswap/poolpricevec.rs
+++ replace > with < in PoolPriceVec<'a>::donation
@@ -424,17 +424,17 @@
             //.filter_map(|(p_avg, _p_end, q_out, liq)| {
             .filter_map(|step| {
                 // We always donate to the lower tick of our liquidity range as that is the
                 // appropriate initialized tick to target
                 let tick_num = step.liq_range.lower_tick();
                 if filled_price > step.avg_price() {
                     let tick_dprice = filled_price - step.avg_price();
                     let tick_reward = tick_dprice.mul_quantity(U256::from(step.output()));
-                    if tick_reward > U256::ZERO {
+                    if tick_reward < /* ~ changed by cargo-mutants ~ */ U256::ZERO {
                         total_donated += tick_reward;
                         Some((tick_num, tick_reward))
                     } else {
                         None
                     }
                 } else {
                     None
                 }

*** result: Success
