*** crates/types/src/matching/uniswap/poolpricevec.rs:459:48: replace == with != in PoolPriceVec<'a>::to_price

*** mutation diff:
--- crates/types/src/matching/uniswap/poolpricevec.rs
+++ replace == with != in PoolPriceVec<'a>::to_price
@@ -451,17 +451,17 @@
 
     // Seems to be unused
     pub fn to_price(&self, target: SqrtPriceX96) -> Option<Self> {
         let (start_in_bounds, end_in_bounds) = if self.is_buy() {
             (Ordering::Greater, Ordering::Less)
         } else {
             (Ordering::Less, Ordering::Greater)
         };
-        if self.start_bound.price.cmp(&target) == start_in_bounds {
+        if self.start_bound.price.cmp(&target) != /* ~ changed by cargo-mutants ~ */ start_in_bounds {
             if self.end_bound.price.cmp(&target) == end_in_bounds {
                 // If the target price is between the start and end bounds, make a subvec
                 let new_upper = self.start_bound.liq_range.pool_snap.at_price(target).ok()?;
                 Some(Self::new(self.start_bound.clone(), new_upper))
             } else {
                 // If the target price is beyond the end bound in the appropriate direction,
                 // return a copy of this existing vector
                 Some(self.clone())

*** result: Success
