*** crates/types/src/matching/uniswap/poolpricevec.rs:61:21: replace >= with < in SwapStep<'a>::for_price_range

*** mutation diff:
--- crates/types/src/matching/uniswap/poolpricevec.rs
+++ replace >= with < in SwapStep<'a>::for_price_range
@@ -53,17 +53,17 @@
     ) -> eyre::Result<Self> {
         // Sort our incoming prices into the low and high price
         let (low, high) = low_to_high(start, end);
         let low_tick = low.to_tick()?;
         let high_tick = high.to_tick()?;
 
         // Make sure both of our price ticks are within bounds, otherwise return an
         // error
-        if low_tick >= liq_range.upper_tick || high_tick < liq_range.lower_tick {
+        if low_tick < /* ~ changed by cargo-mutants ~ */ liq_range.upper_tick || high_tick < liq_range.lower_tick {
             return Err(eyre!("Ticks out of bounds, unable to construct step"))
         }
 
         let start_price = if low_tick >= liq_range.lower_tick {
             *low
         } else {
             SqrtPriceX96::at_tick(liq_range.lower_tick)?
         };

---- matching::composite::tests::restricts_quantities_to_bounds stdout ----
thread 'matching::composite::tests::restricts_quantities_to_bounds' panicked at crates/types/src/matching/composite.rs:271:14:
called `Result::unwrap()` on an `Err` value: Ticks out of bounds, unable to construct step

Location:
    crates/types/src/matching/uniswap/poolpricevec.rs:62:24

---- matching::composite::tests::computes_quantities stdout ----
thread 'matching::composite::tests::computes_quantities' panicked at crates/types/src/matching/composite.rs:50:52:
called `Result::unwrap()` on an `Err` value: Ticks out of bounds, unable to construct step

Location:
    crates/types/src/matching/uniswap/poolpricevec.rs:62:24

---- matching::uniswap::poolpricevec::tests::will_span_segments stdout ----
thread 'matching::uniswap::poolpricevec::tests::will_span_segments' panicked at crates/types/src/matching/uniswap/poolpricevec.rs:568:79:
called `Result::unwrap()` on an `Err` value: Ticks out of bounds, unable to construct step

Location:
    crates/types/src/matching/uniswap/poolpricevec.rs:62:24

failures:
    matching::composite::tests::computes_quantities
    matching::composite::tests::restricts_quantities_to_bounds
    matching::uniswap::poolpricevec::tests::will_span_segments

test result: FAILED. 37 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
