*** crates/types/src/matching/uniswap/poolpricevec.rs:65:39: replace >= with < in SwapStep<'a>::for_price_range

*** mutation diff:
--- crates/types/src/matching/uniswap/poolpricevec.rs
+++ replace >= with < in SwapStep<'a>::for_price_range
@@ -57,17 +57,17 @@
         let high_tick = high.to_tick()?;
 
         // Make sure both of our price ticks are within bounds, otherwise return an
         // error
         if low_tick >= liq_range.upper_tick || high_tick < liq_range.lower_tick {
             return Err(eyre!("Ticks out of bounds, unable to construct step"))
         }
 
-        let start_price = if low_tick >= liq_range.lower_tick {
+        let start_price = if low_tick < /* ~ changed by cargo-mutants ~ */ liq_range.lower_tick {
             *low
         } else {
             SqrtPriceX96::at_tick(liq_range.lower_tick)?
         };
 
         let end_price = if high_tick < liq_range.upper_tick {
             *high
         } else {

---- matching::uniswap::poolpricevec::tests::will_span_segments stdout ----
thread 'matching::uniswap::poolpricevec::tests::will_span_segments' panicked at crates/types/src/matching/uniswap/poolpricevec.rs:568:79:
called `Result::unwrap()` on an `Err` value: Price outside liquidity range

Location:
    crates/types/src/matching/uniswap/poolpricevec.rs:122:24

failures:
    matching::uniswap::poolpricevec::tests::will_span_segments

test result: FAILED. 39 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
