*** crates/types/src/matching/uniswap/poolpricevec.rs:71:38: replace < with > in SwapStep<'a>::for_price_range

*** mutation diff:
--- crates/types/src/matching/uniswap/poolpricevec.rs
+++ replace < with > in SwapStep<'a>::for_price_range
@@ -63,17 +63,17 @@
         }
 
         let start_price = if low_tick >= liq_range.lower_tick {
             *low
         } else {
             SqrtPriceX96::at_tick(liq_range.lower_tick)?
         };
 
-        let end_price = if high_tick < liq_range.upper_tick {
+        let end_price = if high_tick > /* ~ changed by cargo-mutants ~ */ liq_range.upper_tick {
             *high
         } else {
             SqrtPriceX96::at_tick(liq_range.upper_tick)?
         };
 
         Self::compute_info(start_price, end_price, *liq_range)
     }

---- matching::composite::tests::restricts_quantities_to_bounds stdout ----
thread 'matching::composite::tests::restricts_quantities_to_bounds' panicked at crates/types/src/matching/composite.rs:277:9:
Full range improperly calculated

---- matching::uniswap::poolpricevec::tests::will_span_segments stdout ----
thread 'matching::uniswap::poolpricevec::tests::will_span_segments' panicked at crates/types/src/matching/uniswap/poolpricevec.rs:568:79:
called `Result::unwrap()` on an `Err` value: Price outside liquidity range

Location:
    crates/types/src/matching/uniswap/poolpricevec.rs:122:24

failures:
    matching::composite::tests::restricts_quantities_to_bounds
    matching::uniswap::poolpricevec::tests::will_span_segments

test result: FAILED. 38 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
