*** crates/types/src/matching/uniswap/poolsnapshot.rs:128:9: replace PoolSnapshot::liquidity_at_tick -> Option<u128> with Some(0)

*** mutation diff:
--- crates/types/src/matching/uniswap/poolsnapshot.rs
+++ replace PoolSnapshot::liquidity_at_tick -> Option<u128> with Some(0)
@@ -120,11 +120,11 @@
         let price = SqrtPriceX96::at_tick(tick)?;
         let range = self
             .get_range_for_tick(tick)
             .ok_or_eyre("Unable to find tick range for price")?;
         Ok(PoolPrice { liq_range: range, tick, price })
     }
 
     pub fn liquidity_at_tick(&self, tick: Tick) -> Option<u128> {
-        self.get_range_for_tick(tick).map(|range| range.liquidity())
+        Some(0) /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
