*** crates/types/src/matching/uniswap/poolsnapshot.rs:67:9: replace PoolSnapshot::get_range_for_tick -> Option<LiqRangeRef> with None

*** mutation diff:
--- crates/types/src/matching/uniswap/poolsnapshot.rs
+++ replace PoolSnapshot::get_range_for_tick -> Option<LiqRangeRef> with None
@@ -59,21 +59,17 @@
         };
 
         Ok(Self { ranges, sqrt_price_x96, current_tick, cur_tick_idx })
     }
 
     /// Find the PoolRange in this market snapshot that the provided tick lies
     /// within, if any
     pub fn get_range_for_tick(&self, tick: Tick) -> Option<LiqRangeRef> {
-        self.ranges
-            .iter()
-            .enumerate()
-            .find(|(_, r)| r.lower_tick <= tick && tick < r.upper_tick)
-            .map(|(range_idx, range)| LiqRangeRef { pool_snap: self, range, range_idx })
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns a list of references to all liquidity ranges including and
     /// between the given Ticks.  These ranges will be continuous in order.
     pub fn ranges_for_ticks(
         &self,
         start_tick: Tick,
         end_tick: Tick

---- matching::uniswap::poolpricevec::tests::will_span_segments stdout ----
thread 'matching::uniswap::poolpricevec::tests::will_span_segments' panicked at crates/types/src/matching/uniswap/poolpricevec.rs:567:50:
called `Result::unwrap()` on an `Err` value: Unable to find tick range for price

Location:
    crates/types/src/matching/uniswap/poolsnapshot.rs:111:14

failures:
    matching::uniswap::poolpricevec::tests::will_span_segments

test result: FAILED. 39 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
