*** crates/types/src/matching/uniswap/poolsnapshot.rs:81:9: replace PoolSnapshot::ranges_for_ticks -> eyre::Result<Vec<LiqRangeRef>> with Ok(vec![])

*** mutation diff:
--- crates/types/src/matching/uniswap/poolsnapshot.rs
+++ replace PoolSnapshot::ranges_for_ticks -> eyre::Result<Vec<LiqRangeRef>> with Ok(vec![])
@@ -73,30 +73,17 @@
 
     /// Returns a list of references to all liquidity ranges including and
     /// between the given Ticks.  These ranges will be continuous in order.
     pub fn ranges_for_ticks(
         &self,
         start_tick: Tick,
         end_tick: Tick
     ) -> eyre::Result<Vec<LiqRangeRef>> {
-        let (low, high) = low_to_high(&start_tick, &end_tick);
-        let output = self
-            .ranges
-            .iter()
-            .enumerate()
-            .filter_map(|(range_idx, range)| {
-                if range.upper_tick > *low && range.lower_tick <= *high {
-                    Some(LiqRangeRef { pool_snap: self, range, range_idx })
-                } else {
-                    None
-                }
-            })
-            .collect();
-        Ok(output)
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Return a read-only iterator over the liquidity ranges in this snapshot
     pub fn ranges(&self) -> Iter<LiqRange> {
         self.ranges.iter()
     }
 
     pub fn current_price(&self) -> PoolPrice {

---- matching::composite::tests::restricts_quantities_to_bounds stdout ----
thread 'matching::composite::tests::restricts_quantities_to_bounds' panicked at crates/types/src/matching/composite.rs:271:14:
called `Result::unwrap()` on an `Err` value: Unable to find actual end price

Location:
    crates/types/src/matching/uniswap/poolpricevec.rs:258:24

---- matching::composite::tests::computes_quantities stdout ----
thread 'matching::composite::tests::computes_quantities' panicked at crates/types/src/matching/composite.rs:50:52:
called `Result::unwrap()` on an `Err` value: Unable to find actual end price

Location:
    crates/types/src/matching/uniswap/poolpricevec.rs:258:24

---- matching::uniswap::poolpricevec::tests::will_span_segments stdout ----
thread 'matching::uniswap::poolpricevec::tests::will_span_segments' panicked at crates/types/src/matching/uniswap/poolpricevec.rs:571:9:
assertion `left == right` failed: Wrong number of steps in our price vector
  left: 0
 right: 2

failures:
    matching::composite::tests::computes_quantities
    matching::composite::tests::restricts_quantities_to_bounds
    matching::uniswap::poolpricevec::tests::will_span_segments

test result: FAILED. 37 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
