*** crates/types/src/matching/uniswap/poolsnapshot.rs:87:44: replace && with || in PoolSnapshot::ranges_for_ticks

*** mutation diff:
--- crates/types/src/matching/uniswap/poolsnapshot.rs
+++ replace && with || in PoolSnapshot::ranges_for_ticks
@@ -79,17 +79,17 @@
         end_tick: Tick
     ) -> eyre::Result<Vec<LiqRangeRef>> {
         let (low, high) = low_to_high(&start_tick, &end_tick);
         let output = self
             .ranges
             .iter()
             .enumerate()
             .filter_map(|(range_idx, range)| {
-                if range.upper_tick > *low && range.lower_tick <= *high {
+                if range.upper_tick > *low || /* ~ changed by cargo-mutants ~ */ range.lower_tick <= *high {
                     Some(LiqRangeRef { pool_snap: self, range, range_idx })
                 } else {
                     None
                 }
             })
             .collect();
         Ok(output)
     }

*** result: Success
